[
  {
    "name": "Google Analytics",
    "website": "http://www.google.com/analytics",
    "logo": "IMAGE_URL",
    "slug": "google-analytics",
    "description": "Google Analytics lets you measure your advertising ROI as well as track your Flash, video, and social networking sites and applications.",
    "type": "Service"
  },
  {
    "name": "Apache HTTP Server",
    "website": "https://httpd.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "apache-httpd",
    "description": "The Apache HTTP Server is a powerful and flexible HTTP/1.1 compliant web server.  Originally designed as a replacement for the NCSA HTTP Server, it has grown to be the most popular web server on the Internet.",
    "type": "Service"
  },
  {
    "name": "AngularJS",
    "website": "https://angularjs.org/",
    "logo": "IMAGE_URL",
    "slug": "angularjs",
    "description": "AngularJS lets you write client-side web applications as if you had a smarter browser. It lets you use good old HTML (or HAML, Jade and friends!) as your template language and lets you extend HTML’s syntax to express your application’s components clearly and succinctly. It automatically synchronizes data from your UI (view) with your JavaScript objects (model) through 2-way data binding.",
    "type": "Service"
  },
  {
    "name": "Amazon EC2",
    "website": "http://aws.amazon.com/ec2",
    "logo": "IMAGE_URL",
    "slug": "amazon-ec2",
    "description": "It is a web service that provides resizable compute capacity in the cloud. It is designed to make web-scale computing easier for developers.",
    "type": "Service"
  },
  {
    "name": "Amazon S3",
    "website": "http://aws.amazon.com/s3",
    "logo": "IMAGE_URL",
    "slug": "amazon-s3",
    "description": "Amazon Simple Storage Service provides a fully redundant data storage infrastructure for storing and retrieving any amount of data, at any time, from anywhere on the web",
    "type": "Service"
  },
  {
    "name": "Font Awesome",
    "website": "https://fontawesome.com/",
    "logo": "IMAGE_URL",
    "slug": "font-awesome",
    "description": "You can get vector icons and social logos on your website with it. It is a font that\"s made up of symbols, icons, or pictograms that you can use in a webpage, just like a font.",
    "type": "Service"
  },
  {
    "name": "G Suite",
    "website": "https://gsuite.google.com/",
    "logo": "IMAGE_URL",
    "slug": "g-suite",
    "description": "An integrated suite of secure, cloud-native collaboration and productivity apps. It includes Gmail, Docs, Drive, Calendar, Meet and more.",
    "type": "Service"
  },
  {
    "name": "Android SDK",
    "website": "http://developer.android.com",
    "logo": "IMAGE_URL",
    "slug": "android-sdk",
    "description": "Android provides a rich application framework that allows you to build innovative apps and games for mobile devices in a Java language environment.",
    "type": "Service"
  },
  {
    "name": "Amazon CloudFront",
    "website": "http://aws.amazon.com/cloudfront/",
    "logo": "IMAGE_URL",
    "slug": "amazon-cloudfront",
    "description": "Amazon CloudFront can be used to deliver your entire website, including dynamic, static, streaming, and interactive content using a global network of edge locations. Requests for your content are automatically routed to the nearest edge location, so content is delivered with the best possible performance.",
    "type": "Service"
  },
  {
    "name": "Android Studio",
    "website": "https://developer.android.com/sdk/installing/studio.html",
    "logo": "IMAGE_URL",
    "slug": "android-studio",
    "description": "Android Studio is a new Android development environment based on IntelliJ IDEA. It provides new features and improvements over Eclipse ADT and will be the official Android IDE once it\"s ready.",
    "type": "Service"
  },
  {
    "name": "Atom",
    "website": "http://atom.io/",
    "logo": "IMAGE_URL",
    "slug": "atom",
    "description": "At GitHub, we\"re building the text editor we\"ve always wanted. A tool you can customize to do anything, but also use productively on the first day without ever touching a config file. Atom is modern, approachable, and hackable to the core. We can\"t wait to see what you build with it.",
    "type": "Service"
  },
  {
    "name": "ASP.NET",
    "website": "https://www.asp.net/",
    "logo": "IMAGE_URL",
    "slug": "asp-net",
    "description": ".NET is a developer platform made up of tools, programming languages, and libraries for building many different types of applications.",
    "type": "Service"
  },
  {
    "name": "Microsoft Azure",
    "website": "https://azure.microsoft.com/en-us/",
    "logo": "IMAGE_URL",
    "slug": "microsoft-azure",
    "description": "Azure is an open and flexible cloud platform that enables you to quickly build, deploy and manage applications across a global network of Microsoft-managed datacenters. You can build applications using any language, tool or framework. And you can integrate your public cloud applications with your existing IT environment.",
    "type": "Service"
  },
  {
    "name": "Google AdSense",
    "website": "https://www.google.com/adsense/start/",
    "logo": "IMAGE_URL",
    "slug": "google-adsense",
    "description": "It is a program run by Google through which website publishers in the Google Network of content sites serve text, images, video, or interactive media advertisements that are targeted to the site content and audience. ",
    "type": "Service"
  },
  {
    "name": "Ansible",
    "website": "http://www.ansible.com/",
    "logo": "IMAGE_URL",
    "slug": "ansible",
    "description": "Ansible is an IT automation tool. It can configure systems, deploy software, and orchestrate more advanced IT tasks such as continuous deployments or zero downtime rolling updates. Ansible’s goals are foremost those of simplicity and maximum ease of use.",
    "type": "Service"
  },
  {
    "name": "Apache Tomcat",
    "website": "http://tomcat.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "tomcat",
    "description": "Apache Tomcat powers numerous large-scale, mission-critical web applications across a diverse range of industries and organizations.",
    "type": "Service"
  },
  {
    "name": "Amazon RDS",
    "website": "http://aws.amazon.com/rds",
    "logo": "IMAGE_URL",
    "slug": "amazon-rds",
    "description": "Amazon RDS gives you access to the capabilities of a familiar MySQL, Oracle or Microsoft SQL Server database engine. This means that the code, applications, and tools you already use today with your existing databases can be used with Amazon RDS. Amazon RDS automatically patches the database software and backs up your database, storing the backups for a user-defined retention period and enabling point-in-time recovery. You benefit from the flexibility of being able to scale the compute resources or storage capacity associated with your Database Instance (DB Instance) via a single API call.",
    "type": "Service"
  },
  {
    "name": "Amazon Route 53",
    "website": "http://aws.amazon.com/route53",
    "logo": "IMAGE_URL",
    "slug": "amazon-route-53",
    "description": "Amazon Route 53 is designed to give developers and businesses an extremely reliable and cost effective way to route end users to Internet applications by translating human readable names like www.example.com into the numeric IP addresses like 192.0.2.1 that computers use to connect to each other. Route 53 effectively connects user requests to infrastructure running in Amazon Web Services (AWS) – such as an Amazon Elastic Compute Cloud (Amazon EC2) instance, an Amazon Elastic Load Balancer, or an Amazon Simple Storage Service (Amazon S3) bucket – and can also be used to route users to infrastructure outside of AWS.",
    "type": "Service"
  },
  {
    "name": "Amazon EC2 Container Service",
    "website": "https://aws.amazon.com/ecs/",
    "logo": "IMAGE_URL",
    "slug": "amazon-ec2-container-service",
    "description": "Amazon EC2 Container Service lets you launch and stop container-enabled applications with simple API calls, allows you to query the state of your cluster from a centralized service, and gives you access to many familiar Amazon EC2 features like security groups, EBS volumes and IAM roles.",
    "type": "Service"
  },
  {
    "name": "Zendesk",
    "website": "http://www.zendesk.com",
    "logo": "IMAGE_URL",
    "slug": "zendesk",
    "description": "Zendesk provides an integrated on-demand helpdesk - customer support portal solution based on the latest Web 2.0 technologies and design philosophies.",
    "type": "Service"
  },
  {
    "name": "Zoho Mail",
    "website": "https://www.zoho.com/mail/",
    "logo": "IMAGE_URL",
    "slug": "zoho-mail",
    "description": "It is a secure and reliable business email solution tailor-made for your organization\"s communication needs. With enhanced collaboration features, it\"s not just an inbox—it\"s more.",
    "type": "Service"
  },
  {
    "name": "Zoom",
    "website": "https://zoom.us/",
    "logo": "IMAGE_URL",
    "slug": "zoom",
    "description": "Zoom unifies cloud video conferencing, simple online meetings, and cross platform group chat into one easy-to-use platform. Our solution offers the best video, audio, and screen-sharing experience across Zoom Rooms, Windows, Mac, iOS, Android, and H.323/SIP room systems.",
    "type": "Service"
  },
  {
    "name": "Zapier",
    "website": "https://zapier.com/",
    "logo": "IMAGE_URL",
    "slug": "zapier",
    "description": "Zapier is for busy people who know their time is better spent selling, marketing, or coding. Instead of wasting valuable time coming up with complicated systems - you can use Zapier to automate the web services you and your team are already using on a daily basis.",
    "type": "Service"
  },
  {
    "name": "Zeplin",
    "website": "https://zeplin.io/",
    "logo": "IMAGE_URL",
    "slug": "zeplin",
    "description": "Collaboration app for designers & developers. Supports Sketch and Photoshop (on beta!).",
    "type": "Service"
  },
  {
    "name": "Zookeeper",
    "website": "http://zookeeper.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "zookeeper",
    "description": "A centralized service for maintaining configuration information, naming, providing distributed synchronization, and providing group services. All of these kinds of services are used in some form or another by distributed applications.",
    "type": "Service"
  },
  {
    "name": "Zabbix",
    "website": "http://www.zabbix.com/",
    "logo": "IMAGE_URL",
    "slug": "zabbix",
    "description": "Zabbix is a mature and effortless enterprise-class open source monitoring solution for network monitoring and application monitoring of millions of metrics.",
    "type": "Service"
  },
  {
    "name": "Zopim",
    "website": "https://www.zopim.com",
    "logo": "IMAGE_URL",
    "slug": "zopim",
    "description": "Zopim is focused on serving the needs of web users that hasn’t been met by other chat solutions: the need for usability, convenience and simplicity of design",
    "type": "Service"
  },
  {
    "name": "Zulip",
    "website": "https://zulipchat.com/",
    "logo": "IMAGE_URL",
    "slug": "zulip",
    "description": "Zulip is powerful, open source team chat that combines the immediacy of real-time chat with the productivity benefits of threaded conversations.\r\n\r\nZulip allows busy managers and others in meetings all day to participate in their teams chats.",
    "type": "Service"
  },
  {
    "name": "ZeroMQ",
    "website": "http://zeromq.org/",
    "logo": "IMAGE_URL",
    "slug": "zeromq",
    "description": "The 0MQ lightweight messaging kernel is a library which extends the standard socket interfaces with features traditionally provided by specialised messaging middleware products. 0MQ sockets provide an abstraction of asynchronous message queues, multiple messaging patterns, message filtering (subscriptions), seamless access to multiple transport protocols and more.",
    "type": "Service"
  },
  {
    "name": "ZenHub",
    "website": "https://www.zenhub.io/",
    "logo": "IMAGE_URL",
    "slug": "zenhub",
    "description": "ZenHub is a lightweight browser extension that adds a powerful set of features directly into GitHub\"s UI. ",
    "type": "Service"
  },
  {
    "name": "Zend Framework",
    "website": "http://framework.zend.com/",
    "logo": "IMAGE_URL",
    "slug": "zend-framework",
    "description": "It is an open source framework for developing web applications and services using PHP 5.3+. It uses 100% object-oriented code and utilizes most of the new features of namely namespaces, late static binding, lambda functions and closures.",
    "type": "Service"
  },
  {
    "name": "Oh My ZSH",
    "website": "http://ohmyz.sh/",
    "logo": "IMAGE_URL",
    "slug": "oh-my-zsh",
    "description": "A delightful, open source, community-driven framework for managing your Zsh configuration. It comes bundled with thousands of helpful functions, helpers, plugins, themes.",
    "type": "Service"
  },
  {
    "name": "Zepto",
    "website": "http://zeptojs.com/",
    "logo": "IMAGE_URL",
    "slug": "zepto",
    "description": "While 100% jQuery coverage is not a design goal, the APIs provided match their jQuery counterparts. The goal is to have a ~5-10k modular library that downloads and executes fast, with a familiar and versatile API, so you can concentrate on getting stuff done.",
    "type": "Service"
  },
  {
    "name": "Apache Zeppelin",
    "website": "https://zeppelin.incubator.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "zeppelin",
    "description": "A web-based notebook that enables interactive data analytics. You can make beautiful data-driven, interactive and collaborative documents with SQL, Scala and more.",
    "type": "Service"
  },
  {
    "name": "Zoho CRM",
    "website": "http://www.zoho.com/crm",
    "logo": "IMAGE_URL",
    "slug": "zoho-crm",
    "description": "Online CRM software for managing your sales, marketing, customer support, and inventory in a single system",
    "type": "Service"
  },
  {
    "name": "Zsh (Z shell)",
    "website": "https://www.zsh.org/",
    "logo": "IMAGE_URL",
    "slug": "zsh-zshell",
    "description": "An interactive login shell, command interpreter and scripting language.",
    "type": "Service"
  },
  {
    "name": "Zuul",
    "website": "https://github.com/Netflix/zuul",
    "logo": "IMAGE_URL",
    "slug": "zuul",
    "description": "It is the front door for all requests from devices and websites to the backend of the Netflix streaming application. As an edge service application, It is built to enable dynamic routing, monitoring, resiliency, and security. Routing is an integral part of a microservice architecture.",
    "type": "DevOps"
  },
  {
    "name": "Zipkin",
    "website": "https://zipkin.io/",
    "logo": "IMAGE_URL",
    "slug": "zipkin",
    "description": "It helps gather timing data needed to troubleshoot latency problems in service architectures. Features include both the collection and lookup of this data.",
    "type": "DevOps"
  },
  {
    "name": "Zoho",
    "website": "https://www.zoho.com",
    "logo": "IMAGE_URL",
    "slug": "zoho",
    "description": "Unique and powerful suite of software to run your entire business. It contains word processing, spreadsheets, presentations, databases, note-taking, wikis, web conferencing, customer relationship management, project management, invoicing, and other applications.",
    "type": "Business Tools"
  },
  {
    "name": "ES6",
    "website": "http://www.ecma-international.org/ecma-262/6.0/",
    "logo": "IMAGE_URL",
    "slug": "es6",
    "description": "Goals for ECMAScript 2015 include providing better support for large applications, library creation, and for use of ECMAScript as a compilation target for other languages. Some of its major enhancements include modules, class declarations, lexical block scoping, iterators and generators, promises for asynchronous programming, destructuring patterns, and proper tail calls.",
    "type": "Application and Data"
  },
  {
    "name": "Elasticsearch",
    "website": "https://www.elastic.co/products/elasticsearch",
    "logo": "IMAGE_URL",
    "slug": "elasticsearch",
    "description": "Elasticsearch is a distributed, RESTful search and analytics engine capable of storing data and searching it in near real time. Elasticsearch, Kibana, Beats and Logstash are the Elastic Stack (sometimes called the ELK Stack). ",
    "type": "Utilities"
  },
  {
    "name": "ExpressJS",
    "website": "http://expressjs.com/",
    "logo": "IMAGE_URL",
    "slug": "expressjs",
    "description": "Express is a minimal and flexible node.js web application framework, providing a robust set of features for building single and multi-page, and hybrid web applications.",
    "type": "Application and Data"
  },
  {
    "name": "ESLint",
    "website": "http://eslint.org/",
    "logo": "IMAGE_URL",
    "slug": "eslint",
    "description": "A pluggable and configurable linter tool for identifying and reporting on patterns in JavaScript. Maintain your code quality with ease.",
    "type": "DevOps"
  },
  {
    "name": "Google Compute Engine",
    "website": "https://cloud.google.com/products/compute-engine/",
    "logo": "IMAGE_URL",
    "slug": "google-compute-engine",
    "description": "Google Compute Engine is a service that provides virtual machines that run on Google infrastructure. Google Compute Engine offers scale, performance, and value that allows you to easily launch large compute clusters on Google\"s infrastructure. There are no upfront investments and you can run up to thousands of virtual CPUs on a system that has been designed from the ground up to be fast, and to offer strong consistency of performance.",
    "type": "Application and Data"
  },
  {
    "name": "Google App Engine",
    "website": "https://developers.google.com/appengine",
    "logo": "IMAGE_URL",
    "slug": "google-app-engine",
    "description": "Google has a reputation for highly reliable, high performance infrastructure. With App Engine you can take advantage of the 10 years of knowledge Google has in running massively scalable, performance driven systems. App Engine applications are easy to build, easy to maintain, and easy to scale as your traffic and data storage needs grow. ",
    "type": "Application and Data"
  },
  {
    "name": "Electron",
    "website": "http://electron.atom.io/",
    "logo": "IMAGE_URL",
    "slug": "electron",
    "description": "With Electron, creating a desktop application for your company or idea is easy. Initially developed for GitHub\"s Atom editor, Electron has since been used to create applications by companies like Microsoft, Facebook, Slack, and Docker. The Electron framework lets you write cross-platform desktop applications using JavaScript, HTML and CSS. It is based on io.js and Chromium and is used in the Atom editor.",
    "type": "Application and Data"
  },
  {
    "name": "Elixir",
    "website": "http://elixir-lang.org/",
    "logo": "IMAGE_URL",
    "slug": "elixir",
    "description": "Elixir leverages the Erlang VM, known for running low-latency, distributed and fault-tolerant systems, while also being successfully used in web development and the embedded software domain.",
    "type": "Application and Data"
  },
  {
    "name": "Eclipse",
    "website": "https://www.eclipse.org/",
    "logo": "IMAGE_URL",
    "slug": "eclipse",
    "description": "Standard Eclipse package suited for Java and plug-in development plus adding new plugins; already includes Git, Marketplace Client, source code and developer documentation. \r\nClick here to file a bug against Eclipse Platform.",
    "type": "DevOps"
  },
  {
    "name": "AWS Elastic Beanstalk",
    "website": "http://aws.amazon.com/elasticbeanstalk/",
    "logo": "IMAGE_URL",
    "slug": "aws-elastic-beanstalk",
    "description": "Once you upload your application, Elastic Beanstalk automatically handles the deployment details of capacity provisioning, load balancing, auto-scaling, and application health monitoring.",
    "type": "Application and Data"
  },
  {
    "name": "Crazy Egg",
    "website": "http://www.crazyegg.com",
    "logo": "IMAGE_URL",
    "slug": "crazy-egg",
    "description": "Crazy Egg gives you the competitive advantage to improve your website in a heartbeat without the high costs.",
    "type": "Utilities"
  },
  {
    "name": "DNS Made Easy",
    "website": "https://.dnsmadeeasy.com/",
    "logo": "IMAGE_URL",
    "slug": "dns-made-easy",
    "description": "DNS Made Easy is a subsidiary of Tiggee LLC, and is a world leader in providing global IP Anycast enterprise DNS services. DNS Made Easy is currently ranked the fastest provider for 8 consecutive months and the most reliable provider.",
    "type": "Utilities"
  },
  {
    "name": "Ember.js",
    "website": "http://emberjs.com/",
    "logo": "IMAGE_URL",
    "slug": "emberjs",
    "description": "A JavaScript framework that does all of the heavy lifting that you\"d normally have to do by hand. There are tasks that are common to every web app; It does those things for you, so you can focus on building killer features and UI.",
    "type": "Application and Data"
  },
  {
    "name": "Amazon ElastiCache",
    "website": "http://aws.amazon.com/elasticache/",
    "logo": "IMAGE_URL",
    "slug": "amazon-elasticache",
    "description": "ElastiCache improves the performance of web applications by allowing you to retrieve information from fast, managed, in-memory caches, instead of relying entirely on slower disk-based databases. ElastiCache supports Memcached and Redis.",
    "type": "Application and Data"
  },
  {
    "name": "Emacs",
    "website": "http://www.gnu.org/software/emacs/",
    "logo": "IMAGE_URL",
    "slug": "emacs",
    "description": "GNU Emacs is an extensible, customizable text editor—and more. At its core is an interpreter for Emacs Lisp, a dialect of the Lisp programming language with extensions to support text editing. ",
    "type": "DevOps"
  },
  {
    "name": "React",
    "website": "http://facebook.github.io/react/index.html",
    "logo": "IMAGE_URL",
    "slug": "react",
    "description": "Lots of people use React as the V in MVC. Since React makes no assumptions about the rest of your technology stack, it\"s easy to try it out on a small feature in an existing project.",
    "type": "Application and Data"
  },
  {
    "name": "Redis",
    "website": "http://redis.io/",
    "logo": "IMAGE_URL",
    "slug": "redis",
    "description": "Redis is an open source, BSD licensed, advanced key-value store. It is often referred to as a data structure server since keys can contain strings, hashes, lists, sets and sorted sets.",
    "type": "Application and Data"
  },
  {
    "name": "Ruby",
    "website": "https://www.ruby-lang.org",
    "logo": "IMAGE_URL",
    "slug": "ruby",
    "description": "Ruby is a language of careful balance. Its creator, Yukihiro “Matz” Matsumoto, blended parts of his favorite languages (Perl, Smalltalk, Eiffel, Ada, and Lisp) to form a new language that balanced functional programming with imperative programming.",
    "type": "Application and Data"
  },
  {
    "name": "React Native",
    "website": "http://facebook.github.io/",
    "logo": "IMAGE_URL",
    "slug": "react-native",
    "description": "React Native enables you to build world-class application experiences on native platforms using a consistent developer experience based on JavaScript and React. The focus of React Native is on developer efficiency across all the platforms you care about - learn once, write anywhere. Facebook uses React Native in multiple production apps and will continue investing in React Native.",
    "type": "Application and Data"
  },
  {
    "name": "Redux",
    "website": "https://redux.js.org/",
    "logo": "IMAGE_URL",
    "slug": "reduxjs",
    "description": "It helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test. t provides a great experience, such as live code editing combined with a time traveling debugger.",
    "type": "Application and Data"
  },
  {
    "name": "New Relic",
    "website": "http://newrelic.com",
    "logo": "IMAGE_URL",
    "slug": "new-relic",
    "description": "New Relic is the all-in-one web application performance tool that lets you see performance from the end user experience, through servers, and down to the line of application code.",
    "type": "DevOps"
  },
  {
    "name": "Rails",
    "website": "http://rubyonrails.org/",
    "logo": "IMAGE_URL",
    "slug": "rails",
    "description": "Rails is a web-application framework that includes everything needed to create database-backed web applications according to the Model-View-Controller (MVC) pattern.",
    "type": "Application and Data"
  },
  {
    "name": "RabbitMQ",
    "website": "http://www.rabbitmq.com/",
    "logo": "IMAGE_URL",
    "slug": "rabbitmq",
    "description": "RabbitMQ gives your applications a common platform to send and receive messages, and your messages a safe place to live until received.",
    "type": "Application and Data"
  },
  {
    "name": "RequireJS",
    "website": "http://requirejs.org/",
    "logo": "IMAGE_URL",
    "slug": "requirejs",
    "description": "RequireJS loads plain JavaScript files as well as more defined modules. It is optimized for in-browser use, including in a Web Worker, but it can be used in other JavaScript environments, like Rhino and Node. It implements the Asynchronous Module API. Using a modular script loader like RequireJS will improve the speed and quality of your code.",
    "type": "DevOps"
  },
  {
    "name": "Rust",
    "website": "http://www.rust-lang.org/",
    "logo": "IMAGE_URL",
    "slug": "rust",
    "description": "Rust is a systems programming language that combines strong compile-time correctness guarantees with fast performance. It improves upon the ideas of other systems languages like C++ by providing guaranteed memory safety (no crashes, no data races) and complete control over the lifecycle of memory.",
    "type": "Application and Data"
  },
  {
    "name": "Rollbar",
    "website": "https://rollbar.com/",
    "logo": "IMAGE_URL",
    "slug": "rollbar",
    "description": "Rollbar helps development teams find and fix errors faster. Quickly pinpoint what’s broken and why. View exceptions from all of your languages, frameworks, platforms & environments in one place. Get context & insights to defeat all errors.",
    "type": "DevOps"
  },
  {
    "name": "Django REST framework",
    "website": "http://www.django-rest-framework.org/",
    "logo": "IMAGE_URL",
    "slug": "django-rest-framework",
    "description": "It is a powerful and flexible toolkit that makes it easy to build Web APIs.",
    "type": "Application and Data"
  },
  {
    "name": "React Router",
    "website": "https://github.com/rackt/react-router",
    "logo": "IMAGE_URL",
    "slug": "react-router",
    "description": "React Router is a complete routing solution designed specifically for React.js. It painlessly synchronizes the components of your application with the URL, with first-class support for nesting, transitions, and server side rendering.",
    "type": "Application and Data"
  },
  {
    "name": "Red Hat OpenShift",
    "website": "https://openshift.redhat.com/app",
    "logo": "IMAGE_URL",
    "slug": "red-hat-openshift",
    "description": "OpenShift is Red Hat\"s Cloud Computing Platform as a Service (PaaS) offering. OpenShift is an application platform in the cloud where application developers and teams can build, test, deploy, and run their applications.",
    "type": "Application and Data"
  },
  {
    "name": "Amazon Redshift",
    "website": "http://aws.amazon.com/redshift/",
    "logo": "IMAGE_URL",
    "slug": "amazon-redshift",
    "description": "It is optimized for data sets ranging from a few hundred gigabytes to a petabyte or more and costs less than $1,000 per terabyte per year, a tenth the cost of most traditional data warehousing solutions.",
    "type": "Application and Data"
  },
  {
    "name": "Rancher",
    "website": "http://rancher.com/",
    "logo": "IMAGE_URL",
    "slug": "rancher",
    "description": "Rancher is an open source container management platform that includes full distributions of Kubernetes, Apache Mesos and Docker Swarm, and makes it simple to operate container clusters on any cloud or infrastructure platform.",
    "type": "DevOps"
  },
  {
    "name": "Google Tag Manager",
    "website": "https://www.google.com/analytics/tag-manager/",
    "logo": "IMAGE_URL",
    "slug": "google-tag-manager",
    "description": "Tag Manager gives you the ability to add and update your own tags for conversion tracking, site analytics, remarketing, and more. There are nearly endless ways to track user behavior across your sites and apps, and the intuitive design lets you change tags whenever you want.",
    "type": "Utilities"
  },
  {
    "name": "TypeScript",
    "website": "http://www.typescriptlang.org",
    "logo": "IMAGE_URL",
    "slug": "typescript",
    "description": "TypeScript is a language for application-scale JavaScript development. It\"s a typed superset of JavaScript that compiles to plain JavaScript.",
    "type": "Application and Data"
  },
  {
    "name": "Trello",
    "website": "https://trello.com",
    "logo": "IMAGE_URL",
    "slug": "trello",
    "description": "Trello is a collaboration tool that organizes your projects into boards. In one glance, Trello tells you what\"s being worked on, who\"s working on what, and where something is in a process.",
    "type": "Business Tools"
  },
  {
    "name": "Sublime Text",
    "website": "http://www.sublimetext.com/",
    "logo": "IMAGE_URL",
    "slug": "sublime-text",
    "description": "Sublime Text is available for OS X, Windows and Linux. One license is all you need to use Sublime Text on every computer you own, no matter what operating system it uses.\r\n\r\nSublime Text uses a custom UI toolkit, optimized for speed and beauty, while taking advantage of native functionality on each platform.",
    "type": "DevOps"
  },
  {
    "name": "Travis CI",
    "website": "http://travis-ci.com/",
    "logo": "IMAGE_URL",
    "slug": "travis-ci",
    "description": "Free for open source projects, our CI environment provides multiple runtimes (e.g. Node.js or PHP versions), data stores and so on. Because of this, hosting your project on travis-ci.com means you can effortlessly test your library or applications against multiple runtimes and data stores without even having all of them installed locally.",
    "type": "DevOps"
  },
  {
    "name": "Twilio SendGrid",
    "website": "http://sendgrid.com",
    "logo": "IMAGE_URL",
    "slug": "twilio-sendgrid",
    "description": "Twilio SendGrid\"s cloud-based email infrastructure relieves businesses of the cost and complexity of maintaining custom email systems. Twilio SendGrid provides reliable delivery, scalability & real-time analytics along with flexible API\"s.",
    "type": "Utilities"
  },
  {
    "name": "Terraform",
    "website": "http://www.terraform.io/",
    "logo": "IMAGE_URL",
    "slug": "terraform",
    "description": "With Terraform, you describe your complete infrastructure as code, even as it spans multiple service providers. Your servers may come from AWS, your DNS may come from CloudFlare, and your database may come from Heroku. Terraform will build all these resources across all these providers in parallel.",
    "type": "DevOps"
  },
  {
    "name": "Twilio",
    "website": "http://www.twilio.com",
    "logo": "IMAGE_URL",
    "slug": "twilio",
    "description": "Twilio offers developers a powerful API for phone services to make and receive phone calls, and send and receive text messages. Their product allows programmers to more easily integrate various communication methods into their software and programs. ",
    "type": "Utilities"
  },
  {
    "name": "Typekit",
    "website": "https://typekit.com/",
    "logo": "IMAGE_URL",
    "slug": "typekit",
    "description": "It is an online service which offers a subscription library of high-quality fonts. The fonts may be used directly on websites or synced via Adobe Creative Cloud to applications on the subscriber\"s computers.",
    "type": "Application and Data"
  },
  {
    "name": "TensorFlow",
    "website": "https://www.tensorflow.org",
    "logo": "IMAGE_URL",
    "slug": "tensorflow",
    "description": "TensorFlow is an open source software library for numerical computation using data flow graphs. Nodes in the graph represent mathematical operations, while the graph edges represent the multidimensional data arrays (tensors) communicated between them. The flexible architecture allows you to deploy computation to one or more CPUs or GPUs in a desktop, server, or mobile device with a single API.",
    "type": "Utilities"
  },
  {
    "name": "TrackJS",
    "website": "https://tkjs.us/stackshare",
    "logo": "IMAGE_URL",
    "slug": "trackjs",
    "description": "Production error monitoring and reporting for web applications. TrackJS provides deep insights into real user errors. See the user, network, and application events that tell the story of an error so you can actually fix them.",
    "type": "DevOps"
  },
  {
    "name": "TestFlight",
    "website": "https://www.testflightapp.com",
    "logo": "IMAGE_URL",
    "slug": "testflight",
    "description": "With TestFlight, developers simply upload a build, and the testers can install it directly from their device, over the air.",
    "type": "DevOps"
  },
  {
    "name": "Microsoft Teams",
    "website": "https://products.office.com/en-us/microsoft-teams/group-chat-software",
    "logo": "IMAGE_URL",
    "slug": "microsoft-teams",
    "description": "See content and chat history anytime, including team chats with Skype that are visible to the whole team. Private group chats are available for smaller group conversations.",
    "type": "Business Tools"
  },
  {
    "name": "TeamCity",
    "website": "http://www.jetbrains.com/teamcity/",
    "logo": "IMAGE_URL",
    "slug": "teamcity",
    "description": "TeamCity is a user-friendly continuous integration (CI) server for professional developers, build engineers, and DevOps. It is trivial to setup and absolutely free for small teams and open source projects.",
    "type": "DevOps"
  },
  {
    "name": "Pivotal Tracker",
    "website": "http://www.pivotaltracker.com",
    "logo": "IMAGE_URL",
    "slug": "pivotal-tracker",
    "description": "It is a collaborative, lightweight agile project management tool, brought to you by the experts in agile software development.",
    "type": "Business Tools"
  },
  {
    "name": "Traefik",
    "website": "https://traefik.io/",
    "logo": "IMAGE_URL",
    "slug": "traefik",
    "description": "A modern HTTP reverse proxy and load balancer that makes deploying microservices easy. Traefik integrates with your existing infrastructure components and configures itself automatically and dynamically.",
    "type": "DevOps"
  },
  {
    "name": "Tableau",
    "website": "http://www.tableau.com/",
    "logo": "IMAGE_URL",
    "slug": "tableau",
    "description": "Tableau can help anyone see and understand their data. Connect to almost any database, drag and drop to create visualizations, and share with a click.",
    "type": "Application and Data"
  },
  {
    "name": "tawk.to",
    "website": "https://www.tawk.to/",
    "logo": "IMAGE_URL",
    "slug": "tawk-to",
    "description": "It is a live chat support & messaging application that focuses on successful communication between businesses and their customers.",
    "type": "Business Tools"
  },
  {
    "name": "Tailwind CSS",
    "website": "https://tailwindcss.com",
    "logo": "IMAGE_URL",
    "slug": "tailwind-css",
    "description": "Tailwind is different from frameworks like Bootstrap, Foundation, or Bulma in that it\"s not a UI kit. It doesn\"t have a default theme, and there are no build-in UI components. It comes with a menu of predesigned widgets to build your site with, but doesn\"t impose design decisions that are difficult to undo.",
    "type": "Application and Data"
  },
  {
    "name": "Yarn",
    "website": "https://yarnpkg.com/",
    "logo": "IMAGE_URL",
    "slug": "yarn",
    "description": "Yarn caches every package it downloads so it never needs to again. It also parallelizes operations to maximize resource utilization so install times are faster than ever.",
    "type": "Tool"
  },
  {
    "name": "Yeoman",
    "website": "http://yeoman.io/",
    "logo": "IMAGE_URL",
    "slug": "yeoman",
    "description": "Yeoman is a robust and opinionated set of tools, libraries, and a workflow that can help developers quickly build beautiful, compelling web apps. It is comprised of yo - a scaffolding tool using our generator system, grunt - a task runner for your build process and bower for dependency management.",
    "type": "DevOps"
  },
  {
    "name": "Yii",
    "website": "http://www.yiiframework.com/",
    "logo": "IMAGE_URL",
    "slug": "yii",
    "description": "Yii comes with: MVC, DAO/ActiveRecord, I18N/L10N, caching, authentication and role-based access control, scaffolding, testing, etc. It can reduce your development time significantly.",
    "type": "Application and Data"
  },
  {
    "name": "YAML",
    "website": "http://www.yaml.org/",
    "logo": "IMAGE_URL",
    "slug": "yaml",
    "description": "A human-readable data-serialization language. It is commonly used for configuration files, but could be used in many applications where data is being stored or transmitted.",
    "type": "Application and Data"
  },
  {
    "name": "YouTrack",
    "website": "https://www.jetbrains.com/youtrack/",
    "logo": "IMAGE_URL",
    "slug": "youtrack",
    "description": "A project management tool that can be adapted to your processes to help you deliver great products. Track tasks and bugs, plan sprints and releases, create workflows, and customize for your business processes. ",
    "type": "Application and Data"
  },
  {
    "name": "Yammer",
    "website": "https://www.yammer.com",
    "logo": "IMAGE_URL",
    "slug": "yammer",
    "description": "Yammer brings the power of social networking to your company. Collaborate securely across departments, geographies, content and business applications.",
    "type": "Business Tools"
  },
  {
    "name": "graphql-yoga",
    "website": "https://github.com/prisma/graphql-yoga",
    "logo": "IMAGE_URL",
    "slug": "graphql-yoga",
    "description": "Easiest way to run a GraphQL server: Sensible defaults & includes everything you need with minimal setup.;Includes Subscriptions: Built-in support for GraphQL subscriptions using WebSockets.;Compatible: Works with all GraphQL clients (Apollo, Relay...) and fits seamless in your GraphQL workflow.",
    "type": "Application and Data"
  },
  {
    "name": "YARN Hadoop",
    "website": "http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-site/YARN.html",
    "logo": "IMAGE_URL",
    "slug": "yarn-hadoop",
    "description": "Its fundamental idea is to split up the functionalities of resource management and job scheduling/monitoring into separate daemons. The idea is to have a global ResourceManager (RM) and per-application ApplicationMaster (AM).",
    "type": "DevOps"
  },
  {
    "name": "Yocto",
    "website": "https://www.yoctoproject.org/",
    "logo": "IMAGE_URL",
    "slug": "yocto-project",
    "description": "It is an open source collaboration project that helps developers create custom Linux-based systems regardless of the hardware architecture. It provides a flexible set of tools and a space where embedded developers worldwide can share technologies, software stacks, configurations, and best practices that can be used to create tailored Linux images for embedded and IOT devices, or anywhere a customized Linux OS is needed.  ",
    "type": "Application and Data"
  },
  {
    "name": "Engine Yard Cloud",
    "website": "http://www.engineyard.com",
    "logo": "IMAGE_URL",
    "slug": "engine-yard-cloud",
    "description": "The Engine Yard Platform as a Service (PaaS) is a product family that leverages open source technologies to orchestrate and automate the configuration, deployment and management of applications on multiple infrastructures.",
    "type": "Application and Data"
  },
  {
    "name": "Yesod",
    "website": "http://www.yesodweb.com/",
    "logo": "IMAGE_URL",
    "slug": "yesod",
    "description": "Yesod believes in the philosophy of making the compiler your ally, not your enemy. We use the type system to enforce as much as possible, from generating proper links, to avoiding XSS attacks, to dealing with character encoding issues. In general, if your code compiles, it works. And instead of declaring types everywhere you let the compiler figure them out for you with type inference.",
    "type": "Application and Data"
  },
  {
    "name": "Yandex Metrica",
    "website": "https://metrica.yandex.com/promo?",
    "logo": "IMAGE_URL",
    "slug": "yandex-metrica",
    "description": "It helps you get descriptive reports and record the actions of individual users, find out what people are searching for on your site,\ncollect statistics on each ad. Direct, and keep track of conversion rates - even while offline.",
    "type": "Utilities"
  },
  {
    "name": "Yoga",
    "website": "https://facebook.github.io/yoga/",
    "logo": "IMAGE_URL",
    "slug": "yoga",
    "description": "Yoga is a cross-platform layout engine which implements Flexbox. Yoga enables maximum collaboration within your team by implementing an API familiar to many designers and opening it up to developers across different platforms.",
    "type": "Application and Data"
  },
  {
    "name": "Yottaa",
    "website": "http://www.yottaa.com",
    "logo": "IMAGE_URL",
    "slug": "yottaa",
    "description": "Yottaa optimizes, protects and monitors websites and web applications, delivering speed, scale, security and actionable insight. Yottaa customers benefit from websites with better user experience, improved SEO and higher conversions.",
    "type": "Utilities"
  },
  {
    "name": "YugabyteDB",
    "website": "https://www.yugabyte.com/",
    "logo": "IMAGE_URL",
    "slug": "yugabytedb",
    "description": "It is a high-performance distributed SQL database for powering global, internet-scale applications. Built using a unique combination of high-performance document store, per-shard distributed consensus replication and multi-shard ACID transactions.",
    "type": "Application and Data"
  },
  {
    "name": "Yandex Mail",
    "website": "https://connect.yandex.com/pdd/",
    "logo": "IMAGE_URL",
    "slug": "yandex-mail",
    "description": "It is a free feature-rich email service with unlimited mailbox size. It has two-factor authentication and login history to prevent hacking. It scans all incoming mail for both spam, phishing, and malware.",
    "type": "Business Tools"
  },
  {
    "name": "pre-commit by Yelp",
    "website": "http://pre-commit.com/",
    "logo": "IMAGE_URL",
    "slug": "yelp-pre-commit",
    "description": "If one of your developers doesn’t have node installed but modifies a JavaScript file, pre-commit automatically handles downloading and building node to run jshint without root. Pre-commit is a multi-language package manager for pre-commit hooks. You specify a list of hooks you want and pre-commit manages the installation and execution of any hook written in any language before every commit. pre-commit is specifically designed to not require root access.",
    "type": "DevOps"
  },
  {
    "name": "Yew Framework",
    "website": "https://github.com/DenisKolodin/yew",
    "logo": "IMAGE_URL",
    "slug": "yew-framework",
    "description": "A modern Rust framework inspired by Elm and ReactJS. This framework is designed to be compiled into modern browsers\" runtimes: wasm, asm.js, emscripten.",
    "type": "Application and Data"
  },
  {
    "name": "yEd",
    "website": "https://www.yworks.com/products/yed",
    "logo": "IMAGE_URL",
    "slug": "yed",
    "description": "It is a powerful desktop application that can be used to quickly and effectively generate high-quality diagrams.\r\nCreate diagrams manually, or import your external data for analysis. Our automatic layout algorithms arrange even large data sets with just the press of a button.",
    "type": "Application and Data"
  },
  {
    "name": "Ubuntu",
    "website": "http://www.ubuntu.com/",
    "logo": "IMAGE_URL",
    "slug": "ubuntu",
    "description": "Ubuntu is an ancient African word meaning ‘humanity to others’. It also means ‘I am what I am because of who we all are’. The Ubuntu operating system brings the spirit of Ubuntu to the world of computers.",
    "type": "Application and Data"
  },
  {
    "name": "Underscore",
    "website": "http://underscorejs.org/",
    "logo": "IMAGE_URL",
    "slug": "underscore",
    "description": "A JavaScript library that provides a whole mess of useful functional programming helpers without extending any built-in objects. ",
    "type": "Application and Data"
  },
  {
    "name": "Material-UI",
    "website": "https://material-ui.com",
    "logo": "IMAGE_URL",
    "slug": "material-ui",
    "description": "It is a comprehensive guide for visual, motion, and interaction design across platforms and devices.",
    "type": "Application and Data"
  },
  {
    "name": "Swagger UI",
    "website": "https://swagger.io/tools/swagger-ui/",
    "logo": "IMAGE_URL",
    "slug": "swagger-ui",
    "description": "Swagger UI is a dependency-free collection of HTML, Javascript, and CSS assets that dynamically generate beautiful documentation and sandbox from a Swagger-compliant API",
    "type": "Utilities"
  },
  {
    "name": "Semantic UI",
    "website": "http://semantic-ui.com/",
    "logo": "IMAGE_URL",
    "slug": "semantic-ui",
    "description": "Semantic empowers designers and developers by creating a shared vocabulary for UI.",
    "type": "Application and Data"
  },
  {
    "name": "Unity",
    "website": "http://unity3d.com/",
    "logo": "IMAGE_URL",
    "slug": "unity-3d",
    "description": "Unity is the ultimate game development platform. Use Unity to build high-quality 3D and 2D games, deploy them across mobile, desktop, VR/AR, consoles or the Web, and connect with loyal and enthusiastic players and customers.",
    "type": "Application and Data"
  },
  {
    "name": "UIkIt",
    "website": "http://www.getuikit.com/",
    "logo": "IMAGE_URL",
    "slug": "uikit",
    "description": "UIkit gives you a comprehensive collection of HTML, CSS, and JS components\r\nwhich is simple to use, easy to customize and extendable.",
    "type": "Application and Data"
  },
  {
    "name": "Unicorn",
    "website": "http://unicorn.bogomips.org/",
    "logo": "IMAGE_URL",
    "slug": "unicorn",
    "description": "Unicorn is an HTTP server for Rack applications designed to only serve fast clients on low-latency, high-bandwidth connections and take advantage of features in Unix/Unix-like kernels. Slow clients should only be served by placing a reverse proxy capable of fully buffering both the the request and response in between Unicorn and slow clients.",
    "type": "Application and Data"
  },
  {
    "name": "Unbounce",
    "website": "http://unbounce.com",
    "logo": "IMAGE_URL",
    "slug": "unbounce",
    "description": "Unbounce is a self-serve hosted service that provides marketers doing paid search, banner ads, email or social media marketing, the easiest way to create, publish & test promotion specific landing pages without the need for IT or developers.",
    "type": "Business Tools"
  },
  {
    "name": "UserVoice",
    "website": "http://www.uservoice.com",
    "logo": "IMAGE_URL",
    "slug": "uservoice",
    "description": "UserVoice creates simple customer engagement tools that help companies understand and interact with their customers more positively and build customer relationships that last.",
    "type": "Business Tools"
  },
  {
    "name": "Uptime Robot",
    "website": "https://uptimerobot.com/",
    "logo": "IMAGE_URL",
    "slug": "uptime-robot",
    "description": "It is all about helping you to keep your websites up. It monitors your websites every 5 minutes and alerts you if your sites are down.",
    "type": "DevOps"
  },
  {
    "name": "Angular Universal",
    "website": "https://angular.io/guide/universal",
    "logo": "IMAGE_URL",
    "slug": "angular-universal",
    "description": "It executes on the server, generating static application pages that later get bootstrapped on the client. This means that the application generally renders more quickly, giving users a chance to view the application layout before it becomes fully interactive.",
    "type": "Application and Data"
  },
  {
    "name": "Semantic UI React",
    "website": "http://react.semantic-ui.com",
    "logo": "IMAGE_URL",
    "slug": "semantic-ui-react",
    "description": "Semantic UI React is the official React integration for Semantic UI. jQuery Free, Declarative API, Shorthand Props, and more.",
    "type": "Application and Data"
  },
  {
    "name": "uWSGI",
    "website": "https://github.com/unbit/uwsgi",
    "logo": "IMAGE_URL",
    "slug": "uwsgi",
    "description": "The uWSGI project aims at developing a full stack for building hosting services.",
    "type": "Application and Data"
  },
  {
    "name": "UglifyJS",
    "website": "https://github.com/mishoo/UglifyJS2",
    "logo": "IMAGE_URL",
    "slug": "uglifyjs",
    "description": "This package implements a general-purpose JavaScript parser/compressor/beautifier toolkit. It is developed on NodeJS, but it should work on any JavaScript platform supporting the CommonJS module system (and if your platform of choice doesn’t support CommonJS, you can easily implement it, or discard the exports.* lines from UglifyJS sources).",
    "type": "Application and Data"
  },
  {
    "name": "Flat UI",
    "website": "http://designmodo.github.io/Flat-UI/",
    "logo": "IMAGE_URL",
    "slug": "flat-ui",
    "description": "Flat UI is a beautiful theme for Bootstrap. We have redesigned many of its components to look flat in every pixel.",
    "type": "Application and Data"
  },
  {
    "name": "Unreal Engine",
    "website": "https://www.unrealengine.com/en-US/",
    "logo": "IMAGE_URL",
    "slug": "unreal-engine",
    "description": "It is a game engine that helps you make games. It is made up of several components that work together to drive the game. Its massive system of tools and editors allows you to organize your assets and manipulate them to create the gameplay for your game.",
    "type": "Application and Data"
  },
  {
    "name": "Soap UI",
    "website": "http://www.soapui.org/",
    "logo": "IMAGE_URL",
    "slug": "soap-ui",
    "description": "It is an open source functional Testing tool for API Testing. It supports multiple protocols such as SOAP, REST, HTTP, JMS, AMF and JDBC. It supports functional tests, security tests, and virtualization.",
    "type": "Utilities"
  },
  {
    "name": "IntelliJ IDEA",
    "website": "http://www.jetbrains.com/idea/",
    "logo": "IMAGE_URL",
    "slug": "intellij-idea",
    "description": "Out of the box, IntelliJ IDEA provides a comprehensive feature set including tools and integrations with the most important modern technologies and frameworks for enterprise and web development with Java, Scala, Groovy and other languages.",
    "type": "DevOps"
  },
  {
    "name": "Microsoft IIS",
    "website": "http://www.iis.net/",
    "logo": "IMAGE_URL",
    "slug": "microsoft-iis",
    "description": "Internet Information Services (IIS) for Windows Server is a flexible, secure and manageable Web server for hosting anything on the Web. From media streaming to web applications, IIS\"s scalable and open architecture is ready to handle the most demanding tasks.",
    "type": "Application and Data"
  },
  {
    "name": "Socket.IO",
    "website": "http://socket.io/",
    "logo": "IMAGE_URL",
    "slug": "socket-io",
    "description": "It enables real-time bidirectional event-based communication. It works on every platform, browser or device, focusing equally on reliability and speed.",
    "type": "Application and Data"
  },
  {
    "name": "Objective-C",
    "website": "https://developer.apple.com/library/mac/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Introduction/Introduction.html",
    "logo": "IMAGE_URL",
    "slug": "objective-c",
    "description": "Objective-C is a superset of the C programming language and provides object-oriented capabilities and a dynamic runtime. Objective-C inherits the syntax, primitive types, and flow control statements of C and adds syntax for defining classes and methods. It also adds language-level support for object graph management and object literals while providing dynamic typing and binding, deferring many responsibilities until runtime.",
    "type": "Application and Data"
  },
  {
    "name": "Ionic",
    "website": "http://ionicframework.com/",
    "logo": "IMAGE_URL",
    "slug": "ionic",
    "description": "Free and open source, Ionic offers a library of mobile and desktop-optimized HTML, CSS and JS components for building highly interactive apps. Use with Angular, React, Vue, or plain JavaScript.",
    "type": "Application and Data"
  },
  {
    "name": "InVision",
    "website": "http://www.invisionapp.com",
    "logo": "IMAGE_URL",
    "slug": "invision",
    "description": "InVision lets you create stunningly realistic interactive wireframes and prototypes without compromising your creative vision.",
    "type": "Business Tools"
  },
  {
    "name": "Intercom",
    "website": "https://www.intercom.io",
    "logo": "IMAGE_URL",
    "slug": "intercom",
    "description": "Intercom is a customer communication platform with a suite of integrated products for every team—including sales, marketing, product, and support. Have targeted communication with customers on your website, inside  apps, and by email.",
    "type": "Business Tools"
  },
  {
    "name": "AWS IAM",
    "website": "http://aws.amazon.com/iam/",
    "logo": "IMAGE_URL",
    "slug": "aws-iam",
    "description": "AWS Identity and Access Management.",
    "type": "Utilities"
  },
  {
    "name": "iOS",
    "website": "https://www.apple.com/lae/ios/ios-12/",
    "logo": "IMAGE_URL",
    "slug": "ios",
    "description": "It is the operating system that presently powers many of the mobile devices, including the iPhone, iPad, and iPod Touch. It is designed to make your iPhone and iPad experience even faster, more responsive, and more delightful.",
    "type": "Application and Data"
  },
  {
    "name": "Adobe Illustrator",
    "website": "https://www.adobe.com/ru/products/illustrator.html",
    "logo": "IMAGE_URL",
    "slug": "adobe-illustrator",
    "description": "The industry-standard vector graphics app lets you create logos, icons, sketches, typography, and complex illustrations for print, web, interactive, video, and mobile.",
    "type": "Business Tools"
  },
  {
    "name": "Incapsula",
    "website": "http://www.incapsula.com",
    "logo": "IMAGE_URL",
    "slug": "incapsula",
    "description": "Through an application-aware, global content delivery network (CDN), Incapsula provides any website and web application with best-of-breed security, DDoS protection, load balancing and failover solutions.",
    "type": "Utilities"
  },
  {
    "name": "InfluxDB",
    "website": "http://influxdb.com/",
    "logo": "IMAGE_URL",
    "slug": "influxdb",
    "description": "InfluxDB is a scalable datastore for metrics, events, and real-time analytics. It has a built-in HTTP API so you don\"t have to write any server side code to get up and running.\r\n\r\nInfluxDB is designed to be scalable, simple to install and manage, and fast to get data in and out.",
    "type": "Application and Data"
  },
  {
    "name": "Ionicons",
    "website": "http://ionicons.com/",
    "logo": "IMAGE_URL",
    "slug": "ionicons",
    "description": "Premium designed icons for use in web, iOS, Android, and desktop apps. Support for SVG and web font. Completely open source and MIT licensed.",
    "type": "Application and Data"
  },
  {
    "name": "Cloud9 IDE",
    "website": "https://c9.io",
    "logo": "IMAGE_URL",
    "slug": "cloud9-ide",
    "description": "Cloud9 provides a development environment in the cloud. Cloud9 enables developers to get started with coding immediately with pre-setup environments called workspaces, collaborate with their peers with collaborative coding features, and build web apps with features like live preview and browser compatibility testing. It supports more than 40 languages, with class A support for PHP, Ruby, Python, JavaScript/Node.js, and Go.",
    "type": "DevOps"
  },
  {
    "name": "Istio",
    "website": "https://istio.io/",
    "logo": "IMAGE_URL",
    "slug": "istio",
    "description": "Istio is an open platform for providing a uniform way to integrate microservices, manage traffic flow across microservices, enforce policies and aggregate telemetry data. Istio\"s control plane provides an abstraction layer over the underlying cluster management platform, such as Kubernetes, Mesos, etc.",
    "type": "DevOps"
  },
  {
    "name": "Insomnia REST Client",
    "website": "https://insomnia.rest",
    "logo": "IMAGE_URL",
    "slug": "insomnia-rest-client",
    "description": "Insomnia is a powerful REST API Client with cookie management, environment variables, code generation, and authentication for Mac, Window, and Linux.",
    "type": "Utilities"
  },
  {
    "name": "Drone.io",
    "website": "https://drone.io/",
    "logo": "IMAGE_URL",
    "slug": "drone-io",
    "description": "Drone is a hosted continuous integration service. It enables you to conveniently set up projects to automatically build, test, and deploy as you make changes to your code.\r\n\r\nDrone integrates seamlessly with Github, Bitbucket and Google Code as well as third party services such as Heroku, Dotcloud, Google AppEngine and more.",
    "type": "DevOps"
  },
  {
    "name": "IFTTT",
    "website": "https://ifttt.com/",
    "logo": "IMAGE_URL",
    "slug": "ifttt",
    "description": "Create powerful connections with one simple statement: if this then that. For example: \"Backup my contacts to a Google Spreadsheet\"",
    "type": "Business Tools"
  },
  {
    "name": "StatusPage.io",
    "website": "statuspage.io ",
    "logo": "IMAGE_URL",
    "slug": "statuspage-io",
    "description": "The #1 status and incident communication tool. Use Statuspage to build trust with every incident. ",
    "type": "DevOps"
  },
  {
    "name": "DigitalOcean",
    "website": "https://www.digitalocean.com/",
    "logo": "IMAGE_URL",
    "slug": "digitalocean",
    "description": "We take the complexities out of cloud hosting by offering blazing fast, on-demand SSD cloud servers, straightforward pricing, a simple API, and an easy-to-use control panel. ",
    "type": "Application and Data"
  },
  {
    "name": "OpenSSL",
    "website": "https://www.openssl.org/",
    "logo": "IMAGE_URL",
    "slug": "openssl",
    "description": "It is a robust, commercial-grade, and full-featured toolkit for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols. It is also a general-purpose cryptography library.",
    "type": "Application and Data"
  },
  {
    "name": "Optimizely",
    "website": "https://www.optimizely.com",
    "logo": "IMAGE_URL",
    "slug": "optimizely",
    "description": "Optimizely is the market leader in digital experience optimization, helping digital leaders and Fortune 100 companies alike optimize their digital products, commerce, and campaigns with a fully featured experimentation platform.",
    "type": "Utilities"
  },
  {
    "name": "OpenResty",
    "website": "http://openresty.org/",
    "logo": "IMAGE_URL",
    "slug": "openresty",
    "description": "OpenResty (aka. ngx_openresty) is a full-fledged web application server by bundling the standard Nginx core, lots of 3rd-party Nginx modules, as well as most of their external dependencies.",
    "type": "Application and Data"
  },
  {
    "name": "Oracle",
    "website": "http://www.oracle.com/us/products/database/overview/index.html",
    "logo": "IMAGE_URL",
    "slug": "oracle",
    "description": "Oracle Database is an RDBMS. An RDBMS that implements object-oriented features such as user-defined types, inheritance, and polymorphism is called an object-relational database management system (ORDBMS). Oracle Database has extended the relational model to an object-relational model, making it possible to store complex business models in a relational database.",
    "type": "Application and Data"
  },
  {
    "name": "Visual Website Optimizer",
    "website": "https://vwo.com/",
    "logo": "IMAGE_URL",
    "slug": "visual-website-optimizer",
    "description": "Visual Website Optimizer is an easy to use A/B testing tool that allows marketing professionals to create different versions of their websites and landing pages using a point-and-click editor (no HTML knowledge needed!) and then see which version produces maximum conversion rate or sales",
    "type": "Utilities"
  },
  {
    "name": "OpenStack",
    "website": "https://www.openstack.org/",
    "logo": "IMAGE_URL",
    "slug": "openstack",
    "description": "OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a datacenter, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface.",
    "type": "DevOps"
  },
  {
    "name": "OpenCV",
    "website": "http://opencv.org/",
    "logo": "IMAGE_URL",
    "slug": "opencv",
    "description": "OpenCV was designed for computational efficiency and with a strong focus on real-time applications. Written in optimized C/C++, the library can take advantage of multi-core processing. Enabled with OpenCL, it can take advantage of the hardware acceleration of the underlying heterogeneous compute platform.",
    "type": "Utilities"
  },
  {
    "name": "Microsoft Office 365",
    "website": "https://products.office.com/en/business/office",
    "logo": "IMAGE_URL",
    "slug": "microsoft-office-365",
    "description": "Collaborate for free with online versions of Microsoft Word, PowerPoint, Excel, and OneNote. Save documents, spreadsheets, and presentations online, in OneDrive. Share them with others and work together at the same time.",
    "type": "Business Tools"
  },
  {
    "name": "Olark",
    "website": "http://www.olark.com",
    "logo": "IMAGE_URL",
    "slug": "olark",
    "description": "Olark is a lightweight tool to chat with visitors to your website using your existing instant messaging client. Visitors to your website appear as buddies on your Buddy list, their messages to you appear as IMs.",
    "type": "Business Tools"
  },
  {
    "name": "Octopus Deploy",
    "website": "https://octopus.com",
    "logo": "IMAGE_URL",
    "slug": "octopus-deploy",
    "description": "Octopus Deploy helps teams to manage releases, automate deployments, and operate applications with automated runbooks. It\"s free for small teams. ",
    "type": "DevOps"
  },
  {
    "name": "OAuth2",
    "website": "https://oauth.net/2/",
    "logo": "IMAGE_URL",
    "slug": "oauth2",
    "description": "It is an authorization framework that enables a third-party application to obtain limited access to an HTTP service, either on behalf of a resource owner by orchestrating an approval interaction between the resource owner and the HTTP service, or by allowing the third-party application to obtain access on its own behalf.",
    "type": "Application and Data"
  },
  {
    "name": "OVH",
    "website": "https://www.ovh.com/",
    "logo": "IMAGE_URL",
    "slug": "ovh",
    "description": "Hundreds of new servers are installed in our 12 datacenters everyday. For our clients, this guarantees bare-metal resources accessible in less than an hour, and the liberty to use it to rollout the software of their choice. The many functions available on our dedicated servers allow our clients to manage their infrastructure autonomously.",
    "type": "Application and Data"
  },
  {
    "name": "Oracle PL/SQL",
    "website": "http://www.oracle.com/technetwork/database/features/plsql/index.html",
    "logo": "IMAGE_URL",
    "slug": "oracle-pl-sql",
    "description": "It is a powerful, yet straightforward database programming language. It is easy to both write and read, and comes packed with lots of out-of-the-box optimizations and security features. ",
    "type": "Application and Data"
  },
  {
    "name": "Android OS",
    "website": "https://www.android.com",
    "logo": "IMAGE_URL",
    "slug": "android-os",
    "description": "It is a mobile platform which powers phones, tablets, watches, TVs, cars etc. It makes doing business easier, in the office or out in the field. Manage entire fleets of devices with a touch. Keep corporate data protected with built-in security. And help your employees get more done.",
    "type": "Application and Data"
  },
  {
    "name": "OneSignal",
    "website": "https://onesignal.com",
    "logo": "IMAGE_URL",
    "slug": "onesignal",
    "description": "OneSignal is a high volume push notification service for websites and mobile applications. OneSignal supports all major native and mobile platforms by providing dedicated SDKs for each platform, a RESTful server API, and a dashboard.",
    "type": "Utilities"
  },
  {
    "name": "Okta",
    "website": "https://www.okta.com/",
    "logo": "IMAGE_URL",
    "slug": "okta",
    "description": "Connect all your apps in days, not months, with instant access to thousands of pre-built integrations - even add apps to the network yourself. Integrations are easy to set up, constantly monitored, proactively repaired and handle authentication and provisioning.",
    "type": "Business Tools"
  },
  {
    "name": "Python",
    "website": "https://www.python.org",
    "logo": "IMAGE_URL",
    "slug": "python",
    "description": "Python is a general purpose programming language created by Guido Van Rossum. Python is most praised for its elegant syntax and readable code, if you are just beginning your programming career python suits you best.",
    "type": "Application and Data"
  },
  {
    "name": "PHP",
    "website": "http://www.php.net/",
    "logo": "IMAGE_URL",
    "slug": "php",
    "description": "Fast, flexible and pragmatic, PHP powers everything from your blog to the most popular websites in the world.",
    "type": "Application and Data"
  },
  {
    "name": "PostgreSQL",
    "website": "http://www.postgresql.org/",
    "logo": "IMAGE_URL",
    "slug": "postgresql",
    "description": "PostgreSQL is an advanced object-relational database management system\r\nthat supports an extended subset of the SQL standard, including\r\ntransactions, foreign keys, subqueries, triggers, user-defined types\r\nand functions.",
    "type": "Application and Data"
  },
  {
    "name": "Postman",
    "website": "https://www.getpostman.com",
    "logo": "IMAGE_URL",
    "slug": "postman",
    "description": null,
    "type": "Utilities"
  },
  {
    "name": "GitHub Pages",
    "website": "http://pages.github.com/",
    "logo": "IMAGE_URL",
    "slug": "github-pages",
    "description": "Public webpages hosted directly from your GitHub repository. Just edit, push, and your changes are live.",
    "type": "Utilities"
  },
  {
    "name": "PyCharm",
    "website": "https://www.jetbrains.com/pycharm/",
    "logo": "IMAGE_URL",
    "slug": "pycharm",
    "description": "PyCharm’s smart code editor provides first-class support for Python, JavaScript, CoffeeScript, TypeScript, CSS, popular template languages and more. Take advantage of language-aware code completion, error detection, and on-the-fly code fixes!",
    "type": "DevOps"
  },
  {
    "name": "PayPal",
    "website": "https://www.paypal.com",
    "logo": "IMAGE_URL",
    "slug": "paypal",
    "description": "PayPal is an online payments and money transfer service that allows you to send money via email, phone, text message or Skype. They offer products to both individuals and businesses alike, including online vendors, auction sites and corporate users. PayPal connects effortlessly to bank accounts and credit cards.\nPayPal Mobile is one of PayPal’s newest products. It allows you to send payments by text message or by using PayPal’s mobile browser.",
    "type": "Utilities"
  },
  {
    "name": "Google Cloud Platform",
    "website": "https://cloud.google.com",
    "logo": "IMAGE_URL",
    "slug": "google-cloud-platform",
    "description": "It helps you build what\"s next with secure infrastructure, developer tools, APIs, data analytics and machine learning. It is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search and YouTube.",
    "type": "Application and Data"
  },
  {
    "name": "PhpStorm",
    "website": "http://www.jetbrains.com/phpstorm/",
    "logo": "IMAGE_URL",
    "slug": "phpstorm",
    "description": "PhpStorm is a PHP IDE which keeps up with latest PHP & web languages trends, integrates a variety of modern tools, and brings even more extensibility with support for major PHP frameworks.",
    "type": "DevOps"
  },
  {
    "name": "Pingdom",
    "website": "https://www.pingdom.com",
    "logo": "IMAGE_URL",
    "slug": "pingdom",
    "description": "Pingdom is an uptime monitoring service. When problems happen with a site that Pingdom monitors, it immediately alerts the owner so the problem can be taken care of.",
    "type": "DevOps"
  },
  {
    "name": "Prometheus",
    "website": "http://prometheus.io/",
    "logo": "IMAGE_URL",
    "slug": "prometheus",
    "description": "Prometheus is a systems and service monitoring system. It collects metrics from configured targets at given intervals, evaluates rule expressions, displays the results, and can trigger alerts if some condition is observed to be true.",
    "type": "DevOps"
  },
  {
    "name": "Perl",
    "website": "http://www.perl.org/",
    "logo": "IMAGE_URL",
    "slug": "perl",
    "description": "Perl is a general-purpose programming language originally developed for\r\ntext manipulation and now used for a wide range of tasks including\r\nsystem administration, web development, network programming, GUI\r\ndevelopment, and more.",
    "type": "Application and Data"
  },
  {
    "name": "Piwik",
    "website": "https://matomo.org/",
    "logo": "IMAGE_URL",
    "slug": "piwik",
    "description": "Matomo (formerly Piwik) is a full-featured PHP MySQL software program that you download and install on your own webserver. At the end of the five-minute installation process, you will be given a JavaScript code.",
    "type": "Utilities"
  },
  {
    "name": "Adobe Photoshop",
    "website": "http://www.adobe.com/ru/products/photoshop.html",
    "logo": "IMAGE_URL",
    "slug": "adobe-photoshop",
    "description": "It is the best in the world of graphic design and image processing software that will realize any of your ideas. Create and enhance photos, illustrations and 3D graphic objects.",
    "type": "Business Tools"
  },
  {
    "name": "Prototype",
    "website": "http://prototypejs.org/",
    "logo": "IMAGE_URL",
    "slug": "prototype",
    "description": "Prototype is a JavaScript framework that aims to ease development of dynamic web applications. It offers a familiar class-style OO framework, extensive Ajax support, higher-order programming constructs, and easy DOM manipulation.",
    "type": "Application and Data"
  },
  {
    "name": "Pug",
    "website": "https://pugjs.org",
    "logo": "IMAGE_URL",
    "slug": "pug",
    "description": "This project was formerly known as \"Jade.\" Pug is a high performance template engine heavily influenced by Haml and implemented with JavaScript for Node.js and browsers.",
    "type": "Application and Data"
  },
  {
    "name": "Passenger",
    "website": "https://www.phusionpassenger.com/",
    "logo": "IMAGE_URL",
    "slug": "passenger",
    "description": "Phusion Passenger is a web server and application server, designed to be fast, robust and lightweight. It takes a lot of complexity out of deploying web apps, adds powerful enterprise-grade features that are useful in production, and makes administration much easier and less complex.",
    "type": "Application and Data"
  },
  {
    "name": "Pandas",
    "website": "http://pandas.pydata.org/",
    "logo": "IMAGE_URL",
    "slug": "pandas",
    "description": "Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more.",
    "type": "Application and Data"
  },
  {
    "name": "Plesk",
    "website": "https://www.plesk.com",
    "logo": "IMAGE_URL",
    "slug": "plesk",
    "description": "Build and manage multiple sites from a single dashboard. You can also run updates, monitor performance and onboard new prospects all from the same place. It is a WebOps platform to run, automate and grow applications, websites and hosting businesses. ",
    "type": "Application and Data"
  },
  {
    "name": "Quantcast",
    "website": "https://www.quantcast.com/",
    "logo": "IMAGE_URL",
    "slug": "quantcast",
    "description": "It is a digital marketing company that provides free audience demographics measurement and delivers real-time advertising.",
    "type": "Application and Data"
  },
  {
    "name": "Quasar Framework",
    "website": "https://quasar.dev",
    "logo": "IMAGE_URL",
    "slug": "quasar-framework",
    "description": "Build responsive Single Page Apps, SSR Apps, PWAs, Hybrid Mobile Apps and Electron Apps, all using the same codebase!, powered with Vue.",
    "type": "Application and Data"
  },
  {
    "name": "Qt",
    "website": "http://www.qt.io/",
    "logo": "IMAGE_URL",
    "slug": "qt",
    "description": "Qt, a leading cross-platform application and UI framework. With Qt, you can develop applications once and deploy to leading desktop, embedded & mobile targets.",
    "type": "Application and Data"
  },
  {
    "name": "Amazon Quicksight",
    "website": "https://quicksight.aws/",
    "logo": "IMAGE_URL",
    "slug": "amazon-quicksight",
    "description": "Amazon QuickSight is a fast, cloud-powered business analytics service that makes it easy to build visualizations, perform ad-hoc analysis, and quickly get business insights from your data. ",
    "type": "Utilities"
  },
  {
    "name": "Qualaroo",
    "website": "https://qualaroo.com",
    "logo": "IMAGE_URL",
    "slug": "qualaroo",
    "description": "Once you implement the Qualaroo code (it generally only takes a couple minutes), you can easily target a survey question or two as users are making decisions on your website. Your customers will see it slide up from the bottom right-hand corner of your site.",
    "type": "Business Tools"
  },
  {
    "name": "Quip",
    "website": "https://quip.com/",
    "logo": "IMAGE_URL",
    "slug": "quip",
    "description": "Edit and discuss in one place. Quip combines documents with messages so you can work faster, on the web or on the go.",
    "type": "Business Tools"
  },
  {
    "name": "QUnit",
    "website": "http://qunitjs.com/",
    "logo": "IMAGE_URL",
    "slug": "qunit",
    "description": "QUnit is a powerful, easy-to-use JavaScript unit testing framework. It\"s used by the jQuery, jQuery UI and jQuery Mobile projects and is capable of testing any generic JavaScript code, including itself!",
    "type": "DevOps"
  },
  {
    "name": "Quarkus",
    "website": "https://quarkus.io/",
    "logo": "IMAGE_URL",
    "slug": "quarkus",
    "description": "It tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.",
    "type": "Application and Data"
  },
  {
    "name": "QuickBooks",
    "website": "https://quickbooks.intuit.com/global/",
    "logo": "IMAGE_URL",
    "slug": "quickbooks",
    "description": "It is an accounting software package. You can access and manage your books from your computer, laptop, tablet, or smartphone anytime you choose. Create access privileges so that your colleague or accountant can login and work.",
    "type": "Business Tools"
  },
  {
    "name": "Quora",
    "website": "https://www.quora.com/",
    "logo": "IMAGE_URL",
    "slug": "quora",
    "description": "It connects you to everything you want to know about. Quora aims to be the easiest place to write new content and share content from the web. We organize people and their interests so you can find, collect and share the information most valuable to you.",
    "type": "Business Tools"
  },
  {
    "name": "Quay.io",
    "website": "https://quay.io/",
    "logo": "IMAGE_URL",
    "slug": "quay-io",
    "description": "Simply upload your Dockerfile (and any additional files it needs) and we\"ll build your Dockerfile into an image and push it to your repository.",
    "type": "DevOps"
  },
  {
    "name": "Qt Creator",
    "website": "https://www.qt.io/ide/",
    "logo": "IMAGE_URL",
    "slug": "qt-creator",
    "description": "It is a cross platform integrated development environment (IDE) to create C++ and QML applications for multiple desktop, embedded and mobile platforms. It comes with a code editor, and is integrated with tools for designing, coding, testing, deploying and maintaining your software throughout its product lifecycle.",
    "type": "Application and Data"
  },
  {
    "name": "Qlik Sense",
    "website": "http://www.qlik.com/us/products/qlik-sense",
    "logo": "IMAGE_URL",
    "slug": "qlik-sense",
    "description": "It helps uncover insights that query-based BI tools simply miss. Our one-of-a-kind Associative Engine brings together all your data so users can freely search and explore to find new connections. AI and cognitive capabilities offer insight suggestions, automation and conversational interaction.",
    "type": "Application and Data"
  },
  {
    "name": "Qubole",
    "website": "http://www.qubole.com/",
    "logo": "IMAGE_URL",
    "slug": "qubole",
    "description": "Qubole is a cloud based service that makes big data easy for analysts and data engineers.",
    "type": "Application and Data"
  },
  {
    "name": "Qemu",
    "website": "http://wiki.qemu.org/Main_Page",
    "logo": "IMAGE_URL",
    "slug": "qemu",
    "description": "When used as a machine emulator, it can run OSes and programs made for one machine (e.g. an ARM board) on a different machine (e.g. your own PC). By using dynamic translation, it achieves very good performance.\r\n\r\nWhen used as a virtualizer, it achieves near native performance by executing the guest code directly on the host CPU. it supports virtualization when executing under the Xen hypervisor or using the KVM kernel module in Linux. When using KVM, it can virtualize x86, server and embedded PowerPC, 64-bit POWER, S390, 32-bit and 64-bit ARM, and MIPS guests.",
    "type": "Application and Data"
  },
  {
    "name": "Qt5",
    "website": "http://doc.qt.io/qt-5/",
    "logo": "IMAGE_URL",
    "slug": "qt5",
    "description": "It is a full development framework with tools designed to streamline the creation of applications and user interfaces for desktop, embedded, and mobile platforms.",
    "type": "Application and Data"
  },
  {
    "name": "Rainforest QA",
    "website": "https://www.rainforestqa.com/",
    "logo": "IMAGE_URL",
    "slug": "rainforest-qa",
    "description": "Rainforest gives you the reliability of a QA team and the speed of automation, without the hassle of managing a team or the pain of writing automated tests.",
    "type": "DevOps"
  },
  {
    "name": "QlikView",
    "website": "http://www.qlik.com/de/explore/products/qlikview",
    "logo": "IMAGE_URL",
    "slug": "qlikview",
    "description": "It is a business discovery platform that provides self-service BI for all business users in organizations. With this tool, you can analyze data and use your data discoveries to support decision making.",
    "type": "Application and Data"
  },
  {
    "name": "QuickBlox",
    "website": "https://quickblox.com/",
    "logo": "IMAGE_URL",
    "slug": "quickblox",
    "description": "Add powerful communication features to your mobile app and data services for your backend",
    "type": "Utilities"
  },
  {
    "name": "QueryDSL",
    "website": "http://www.querydsl.com/",
    "logo": "IMAGE_URL",
    "slug": "querydsl",
    "description": "It is an extensive Java framework, which allows for the generation of type-safe queries in a syntax similar to SQL. It currently has a wide range of support for various backends through the use of separate modules including JPA, JDO, SQL, Java collections, RDF, Lucene, Hibernate Search, and MongoDB",
    "type": "Application and Data"
  },
  {
    "name": "Slack",
    "website": "https://slack.com/",
    "logo": "IMAGE_URL",
    "slug": "slack",
    "description": "Imagine all your team communication in one place, instantly searchable, available wherever you go. That’s Slack. All your messages. All your files. And everything from Twitter, Dropbox, Google Docs, Asana, Trello, GitHub and dozens of other services. All together.",
    "type": "Business Tools"
  },
  {
    "name": "Visual Studio Code",
    "website": "https://code.visualstudio.com/",
    "logo": "IMAGE_URL",
    "slug": "visual-studio-code",
    "description": "Build and debug modern web and cloud applications. Code is free and available on your favorite platform - Linux, Mac OSX, and Windows.",
    "type": "DevOps"
  },
  {
    "name": "C#",
    "website": "http://csharp.net",
    "logo": "IMAGE_URL",
    "slug": "c-sharp",
    "description": "C# (pronounced \"See Sharp\") is a simple, modern, object-oriented, and type-safe programming language. C# has its roots in the C family of languages and will be immediately familiar to C, C++, Java, and JavaScript programmers.",
    "type": "Application and Data"
  },
  {
    "name": "Sass",
    "website": "http://sass-lang.com/",
    "logo": "IMAGE_URL",
    "slug": "sass",
    "description": "Sass is an extension of CSS3, adding nested rules, variables, mixins, selector inheritance, and more. It\"s translated to well-formatted, standard CSS using the command line tool or a web-framework plugin.",
    "type": "Application and Data"
  },
  {
    "name": "Visual Studio",
    "website": "http://msdn.microsoft.com/en-us/vstudio/aa718325.aspx",
    "logo": "IMAGE_URL",
    "slug": "visual-studio",
    "description": "Visual Studio is a suite of component-based software development tools and other technologies for building powerful, high-performance applications.",
    "type": "DevOps"
  },
  {
    "name": "Spring Boot",
    "website": "https://spring.io/projects/spring-boot",
    "logo": "IMAGE_URL",
    "slug": "spring-boot",
    "description": "Spring Boot makes it easy to create stand-alone, production-grade Spring based Applications that you can \"just run\". We take an opinionated view of the Spring platform and third-party libraries so you can get started with minimum fuss. Most Spring Boot applications need very little Spring configuration.",
    "type": "Application and Data"
  },
  {
    "name": "Skype",
    "website": "http://www.skype.com/",
    "logo": "IMAGE_URL",
    "slug": "skype",
    "description": "Skype’s text, voice and video make it simple to share experiences with the people that matter to you, wherever they are.",
    "type": "Business Tools"
  },
  {
    "name": "Swift",
    "website": "https://developer.apple.com/swift/",
    "logo": "IMAGE_URL",
    "slug": "swift",
    "description": "Writing code is interactive and fun, the syntax is concise yet expressive, and apps run lightning-fast. Swift is ready for your next iOS and OS X project — or for addition into your current app — because Swift code works side-by-side with Objective-C.",
    "type": "Application and Data"
  },
  {
    "name": "Stripe",
    "website": "https://stripe.com",
    "logo": "IMAGE_URL",
    "slug": "stripe",
    "description": "Stripe makes it easy for developers to accept credit cards on the web.",
    "type": "Utilities"
  },
  {
    "name": "Microsoft SQL Server",
    "website": "http://microsoft.com/sqlserver",
    "logo": "IMAGE_URL",
    "slug": "microsoft-sql-server",
    "description": "Microsoft® SQL Server is a database management and analysis system for e-commerce, line-of-business, and data warehousing solutions. ",
    "type": "Application and Data"
  },
  {
    "name": "SQLite",
    "website": "http://www.sqlite.org/",
    "logo": "IMAGE_URL",
    "slug": "sqlite",
    "description": "SQLite is an embedded SQL database engine. Unlike most other SQL databases, SQLite does not have a separate server process. SQLite reads and writes directly to ordinary disk files. A complete SQL database with multiple tables, indices, triggers, and views, is contained in a single disk file.",
    "type": "Application and Data"
  },
  {
    "name": "D",
    "website": "http://dlang.org/",
    "logo": "IMAGE_URL",
    "slug": "d",
    "description": "D is a language with C-like syntax and static typing. It pragmatically combines efficiency, control, and modeling power, with safety and programmer productivity.",
    "type": "Application and Data"
  },
  {
    "name": "Docker",
    "website": "https://www.docker.com/",
    "logo": "IMAGE_URL",
    "slug": "docker",
    "description": "The Docker Platform is the industry-leading container platform for continuous, high-velocity innovation, enabling organizations to seamlessly build and share any application — from legacy to what comes next  — and securely run them anywhere",
    "type": "DevOps"
  },
  {
    "name": "Google Drive",
    "website": "https://developers.google.com/drive",
    "logo": "IMAGE_URL",
    "slug": "google-drive",
    "description": "Keep photos, stories, designs, drawings, recordings, videos, and more. Your first 15 GB of storage are free with a Google Account. Your files in Drive can be reached from any smartphone, tablet, or computer.",
    "type": "Utilities"
  },
  {
    "name": "Django",
    "website": "https://www.djangoproject.com/",
    "logo": "IMAGE_URL",
    "slug": "django",
    "description": "Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design.",
    "type": "Application and Data"
  },
  {
    "name": "Dropbox",
    "website": "https://www.dropbox.com/developers",
    "logo": "IMAGE_URL",
    "slug": "dropbox",
    "description": "Harness the power of Dropbox. Connect to an account, upload, download, search, and more.",
    "type": "Utilities"
  },
  {
    "name": "Docker Compose",
    "website": "https://github.com/docker/compose",
    "logo": "IMAGE_URL",
    "slug": "docker-compose",
    "description": "With Compose, you define a multi-container application in a single file, then spin your application up in a single command which does everything that needs to be done to get it running.",
    "type": "DevOps"
  },
  {
    "name": "Debian",
    "website": "https://www.debian.org/",
    "logo": "IMAGE_URL",
    "slug": "debian",
    "description": "Debian systems currently use the Linux kernel or the FreeBSD kernel. Linux is a piece of software started by Linus Torvalds and supported by thousands of programmers worldwide. FreeBSD is an operating system including a kernel and other software.",
    "type": "Application and Data"
  },
  {
    "name": "Material Design for Angular",
    "website": "https://github.com/angular/material",
    "logo": "IMAGE_URL",
    "slug": "material-design-for-angular",
    "description": "Material Design is a specification for a unified system of visual, motion, and interaction design that adapts across different devices. Our goal is to deliver a lean, lightweight set of AngularJS-native UI elements that implement the material design system for use in Angular SPAs.",
    "type": "Application and Data"
  },
  {
    "name": "Drupal",
    "website": "https://www.drupal.org/",
    "logo": "IMAGE_URL",
    "slug": "drupal",
    "description": "Drupal is an open source content management platform powering millions of websites and applications. It’s built, used, and supported by an active and diverse community of people around the world.",
    "type": "Business Tools"
  },
  {
    "name": "Datadog",
    "website": "https://www.datadoghq.com/lpg/?utm_source=Advertisement&utm_medium=StackShare&utm_campaign=StackShare-Other",
    "logo": "IMAGE_URL",
    "slug": "datadog",
    "description": "Datadog is the leading service for cloud-scale monitoring. It is used by IT, operations, and development teams who build and operate applications that run on dynamic or hybrid cloud infrastructure. Start monitoring in minutes with Datadog!",
    "type": "DevOps"
  },
  {
    "name": "Amazon DynamoDB",
    "website": "http://aws.amazon.com/dynamodb/",
    "logo": "IMAGE_URL",
    "slug": "amazon-dynamodb",
    "description": "With it , you can offload the administrative burden of operating and scaling a highly available distributed database cluster, while paying a low price for only what you use.",
    "type": "Application and Data"
  },
  {
    "name": "Disqus",
    "website": "http://disqus.com",
    "logo": "IMAGE_URL",
    "slug": "disqus",
    "description": "Disqus looks to make it very easy and rewarding for people to interact on websites using its system. Commenters can build reputation and carry their contributions from one website to the next. ",
    "type": "Utilities"
  },
  {
    "name": "Google Cloud DNS",
    "website": "https://cloud.google.com/products/cloud-dns/",
    "logo": "IMAGE_URL",
    "slug": "google-cloud-dns",
    "description": "Use Google\"s infrastructure for production quality, high volume DNS serving. Your users will have reliable, low-latency access to Google\"s infrastructure from anywhere in the world using our network of Anycast name servers.",
    "type": "Utilities"
  },
  {
    "name": "Dart",
    "website": "https://www.dartlang.org/",
    "logo": "IMAGE_URL",
    "slug": "dart",
    "description": "Dart is a cohesive, scalable platform for building apps that run on the web (where you can use Polymer) or on servers (such as with Google Cloud Platform). Use the Dart language, libraries, and tools to write anything from simple scripts to full-featured apps.",
    "type": "Application and Data"
  },
  {
    "name": "Azure DevOps",
    "website": "https://visualstudio.microsoft.com/team-services/",
    "logo": "IMAGE_URL",
    "slug": "azure-devops",
    "description": "Azure DevOps provides unlimited private Git hosting, cloud build for continuous integration, agile planning, and release management for continuous delivery to the cloud and on-premises.  Includes broad IDE support.",
    "type": "DevOps"
  },
  {
    "name": "F#",
    "website": "http://fsharp.org/",
    "logo": "IMAGE_URL",
    "slug": "f-sharp",
    "description": "F# is a mature, open source, cross-platform, functional-first programming language. It empowers users and organizations to tackle complex computing problems with simple, maintainable and robust code.",
    "type": "Application and Data"
  },
  {
    "name": "Google Fonts",
    "website": "https://fonts.google.com/",
    "logo": "IMAGE_URL",
    "slug": "google-fonts",
    "description": "A library of 915 free licensed fonts, an interactive web directory for browsing the library, and APIs for conveniently using the fonts via CSS and Android.",
    "type": "Application and Data"
  },
  {
    "name": "Firebase",
    "website": "https://www.firebase.com",
    "logo": "IMAGE_URL",
    "slug": "firebase",
    "description": "Firebase is a cloud service designed to power real-time, collaborative applications. Simply add the Firebase library to your application to gain access to a shared data structure; any changes you make to that data are automatically synchronized with the Firebase cloud and with other clients within milliseconds.",
    "type": "Application and Data"
  },
  {
    "name": "Flask",
    "website": "http://flask.pocoo.org/",
    "logo": "IMAGE_URL",
    "slug": "flask",
    "description": "Flask is intended for getting started very quickly and was developed with best intentions in mind.",
    "type": "Application and Data"
  },
  {
    "name": "fancybox",
    "website": "http://fancyapps.com/fancybox/3/",
    "logo": "IMAGE_URL",
    "slug": "fancybox",
    "description": "It is a tool that offers a nice and elegant way to add zooming functionality for images, html content and multi-media on your webpages. It is built on the top of the popular JavaScript framework jQuery and is both easy to implement and a snap to customize.",
    "type": "Application and Data"
  },
  {
    "name": "Flutter",
    "website": "https://flutter.io/",
    "logo": "IMAGE_URL",
    "slug": "flutter",
    "description": "Flutter is a mobile app SDK to help developers and designers build modern mobile apps for iOS and Android.",
    "type": "Application and Data"
  },
  {
    "name": "Foundation",
    "website": "https://get.foundation/",
    "logo": "IMAGE_URL",
    "slug": "foundation",
    "description": "Foundation is the most advanced responsive front-end framework in the world. You can quickly prototype and build sites or apps that work on any kind of device with Foundation, which includes layout constructs (like a fully responsive grid), elements and best practices.",
    "type": "Application and Data"
  },
  {
    "name": "Gravity Forms",
    "website": "https://www.gravityforms.com/",
    "logo": "IMAGE_URL",
    "slug": "gravity-forms",
    "description": "It is a WordPress plugin used originally for contact forms, but in a more general sense, it allows site owners to create forms to collect information. It can be used for contact forms, WordPress post creation, calculators, employment applications and more.",
    "type": "Application and Data"
  },
  {
    "name": "Figma",
    "website": "https://www.figma.com/",
    "logo": "IMAGE_URL",
    "slug": "figma",
    "description": "Figma is the first interface design tool with real-time collaboration. It keeps everyone on the same page. Focus on the work instead of fighting your tools.",
    "type": "Business Tools"
  },
  {
    "name": "Phoenix Framework",
    "website": "http://www.phoenixframework.org",
    "logo": "IMAGE_URL",
    "slug": "phoenix-framework",
    "description": "Phoenix is a framework for building HTML5 apps, API backends and distributed systems. Written in Elixir, you get beautiful syntax, productive tooling and a fast runtime.",
    "type": "Application and Data"
  },
  {
    "name": "Fastly",
    "website": "http://www.fastly.com",
    "logo": "IMAGE_URL",
    "slug": "fastly",
    "description": "Fastly\"s real-time content delivery network gives you total control over your content, unprecedented access to performance analytics, and the ability to instantly update content in 150 milliseconds.",
    "type": "Utilities"
  },
  {
    "name": "Amazon RDS for PostgreSQL",
    "website": "http://aws.amazon.com/rds/postgresql/",
    "logo": "IMAGE_URL/amazon-rds.png",
    "slug": "amazon-rds-for-postgresql",
    "description": "Amazon RDS manages complex and time-consuming administrative tasks such as PostgreSQL software installation and upgrades, storage management, replication for high availability and back-ups for disaster recovery. With just a few clicks in the AWS Management Console, you can deploy a PostgreSQL database with automatically configured database parameters for optimal performance. Amazon RDS for PostgreSQL database instances can be provisioned with either standard storage or Provisioned IOPS storage. Once provisioned, you can scale from 10GB to 3TB of storage and from 1,000 IOPS to 30,000 IOPS. ",
    "type": "Application and Data"
  },
  {
    "name": "Amazon RDS for Aurora",
    "website": "http://aws.amazon.com/rds/aurora",
    "logo": "IMAGE_URL/amazon-rds.png",
    "slug": "amazon-rds-for-aurora",
    "description": "Amazon Aurora is a MySQL-compatible, relational database engine that combines the speed and availability of high-end commercial databases with the simplicity and cost-effectiveness of open source databases. Amazon Aurora provides up to five times better performance than MySQL at a price point one tenth that of a commercial database while delivering similar performance and availability.",
    "type": "Application and Data"
  },
  {
    "name": "Flux",
    "website": "http://facebook.github.io/flux/",
    "logo": "IMAGE_URL",
    "slug": "flux",
    "description": "Flux is the application architecture that Facebook uses for building client-side web applications. It complements React\"s composable view components by utilizing a unidirectional data flow. It\"s more of a pattern rather than a formal framework, and you can start using Flux immediately without a lot of new code.",
    "type": "Application and Data"
  },
  {
    "name": "Cloud Firestore",
    "website": "https://firebase.google.com/products/firestore/",
    "logo": "IMAGE_URL",
    "slug": "google-cloud-firestore",
    "description": "Cloud Firestore is a NoSQL document database that lets you easily store, sync, and query data for your mobile and web apps - at global scale.",
    "type": "Application and Data"
  },
  {
    "name": "Spring Framework",
    "website": "https://spring.io/projects/spring-framework",
    "logo": "IMAGE_URL",
    "slug": "spring-framework",
    "description": "It provides a comprehensive programming and configuration model for modern Java-based enterprise applications - on any kind of deployment platform.\r\nThe framework\"s core features can be used by any Java application, but there are extensions for building web applications on top of the Java EE platform.",
    "type": "Application and Data"
  },
  {
    "name": "GitHub",
    "website": "https://github.com/",
    "logo": "IMAGE_URL",
    "slug": "github",
    "description": "GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over three million people use GitHub to build amazing things together.",
    "type": "DevOps"
  },
  {
    "name": "Git",
    "website": "http://git-scm.com/",
    "logo": "IMAGE_URL",
    "slug": "git",
    "description": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.",
    "type": "DevOps"
  },
  {
    "name": "Gmail",
    "website": "https://mail.google.com",
    "logo": "IMAGE_URL",
    "slug": "gmail",
    "description": "An easy to use email app that saves you time and keeps your messages safe. Get your messages instantly via push notifications, read and respond online & offline, and find any message quickly.",
    "type": "Business Tools"
  },
  {
    "name": "GitLab",
    "website": "https://about.gitlab.com/",
    "logo": "IMAGE_URL",
    "slug": "gitlab",
    "description": "GitLab offers git repository management, code reviews, issue tracking, activity feeds and wikis. Enterprises install GitLab on-premise and connect it with LDAP and Active Directory servers for secure authentication and authorization. A single GitLab server can handle more than 25,000 users but it is also possible to create a high availability setup with multiple active servers.",
    "type": "DevOps"
  },
  {
    "name": "Google Maps",
    "website": "https://developers.google.com/maps/",
    "logo": "IMAGE_URL",
    "slug": "google-maps",
    "description": "Create rich applications and stunning visualisations of your data, leveraging the comprehensiveness, accuracy, and usability of Google Maps and a modern web platform that scales as you grow.",
    "type": "Utilities"
  },
  {
    "name": "GraphQL",
    "website": "http://graphql.org/",
    "logo": "IMAGE_URL",
    "slug": "graphql",
    "description": "GraphQL is a data query language and runtime designed and used at Facebook to request and deliver data to mobile and web apps since 2012.",
    "type": "Application and Data"
  },
  {
    "name": "Go",
    "website": "http://golang.org/",
    "logo": "IMAGE_URL",
    "slug": "go",
    "description": "Go is expressive, concise, clean, and efficient. Its concurrency mechanisms make it easy to write programs that get the most out of multicore and networked machines, while its novel type system enables flexible and modular program construction. Go compiles quickly to machine code yet has the convenience of garbage collection and the power of run-time reflection. It\"s a fast, statically typed, compiled language that feels like a dynamically typed, interpreted language.",
    "type": "Application and Data"
  },
  {
    "name": "gulp",
    "website": "http://gulpjs.com/",
    "logo": "IMAGE_URL",
    "slug": "gulp",
    "description": "Build system automating tasks: minification and copying of all JavaScript files, static images. More capable of watching files to automatically rerun the task when a file changes.",
    "type": "DevOps"
  },
  {
    "name": "Grafana",
    "website": "http://grafana.org/",
    "logo": "IMAGE_URL",
    "slug": "grafana",
    "description": "Grafana is a general purpose dashboard and graph composer. It\"s focused on providing rich ways to visualize time series metrics, mainly though graphs but supports other ways to visualize data through a pluggable panel architecture. It currently has rich support for for Graphite, InfluxDB and OpenTSDB. But supports other data sources via plugins.",
    "type": "DevOps"
  },
  {
    "name": "Gradle",
    "website": "https://www.gradle.org/",
    "logo": "IMAGE_URL",
    "slug": "gradle",
    "description": "Gradle is a build tool with a focus on build automation and support for multi-language development. If you are building, testing, publishing, and deploying software on any platform, Gradle offers a flexible model that can support the entire development lifecycle from compiling and packaging code to publishing web sites.",
    "type": "DevOps"
  },
  {
    "name": "HTML5",
    "website": "http://www.w3.org/TR/html5/",
    "logo": "IMAGE_URL",
    "slug": "html5",
    "description": "HTML5 is a core technology markup language of the Internet used for structuring and presenting content for the World Wide Web. As of October 2014 this is the final and complete fifth revision of the HTML standard of the World Wide Web Consortium (W3C). The previous version, HTML 4, was standardised in 1997.",
    "type": "Application and Data"
  },
  {
    "name": "Heroku",
    "website": "https://www.heroku.com",
    "logo": "IMAGE_URL",
    "slug": "heroku",
    "description": "Heroku is a cloud application platform – a new way of building and deploying web apps. Heroku lets app developers spend 100% of their time on their application code, not managing servers, deployment, ongoing operations, or scaling.",
    "type": "Application and Data"
  },
  {
    "name": "HubSpot",
    "website": "http://www.hubspot.com",
    "logo": "IMAGE_URL",
    "slug": "hubspot",
    "description": "Attract, convert, close and delight customers with HubSpot’s complete set of marketing tools. HubSpot all-in-one marketing software helps more than 12,000 companies in 56 countries attract leads and convert them into customers. ",
    "type": "Business Tools"
  },
  {
    "name": "Handlebars.js",
    "website": "http://handlebarsjs.com/",
    "logo": "IMAGE_URL",
    "slug": "handlebars",
    "description": "Handlebars.js is an extension to the Mustache templating language created by Chris Wanstrath. Handlebars.js and Mustache are both logicless templating languages that keep the view and the code separated like we all know they should be.",
    "type": "Application and Data"
  },
  {
    "name": "HAProxy",
    "website": "http://www.haproxy.org/",
    "logo": "IMAGE_URL",
    "slug": "haproxy",
    "description": "HAProxy (High Availability Proxy) is a free, very fast and reliable solution offering high availability, load balancing, and proxying for TCP and HTTP-based applications.",
    "type": "DevOps"
  },
  {
    "name": "Hadoop",
    "website": "http://hadoop.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "hadoop",
    "description": "The Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. It is designed to scale up from single servers to thousands of machines, each offering local computation and storage.",
    "type": "Application and Data"
  },
  {
    "name": "HipChat",
    "website": "https://www.hipchat.com",
    "logo": "IMAGE_URL",
    "slug": "hipchat",
    "description": "HipChat is a hosted private chat service for your company or team. Invite colleagues to share ideas and files in persistent group chat rooms. Get your team off AIM, Google Talk, and Skype — HipChat was built for business.",
    "type": "Business Tools"
  },
  {
    "name": "Highcharts",
    "website": "http://www.highcharts.com/products/highcharts",
    "logo": "IMAGE_URL",
    "slug": "highcharts",
    "description": "Highcharts currently supports line, spline, area, areaspline, column, bar, pie, scatter, angular gauges, arearange, areasplinerange, columnrange, bubble, box plot, error bars, funnel, waterfall and polar chart types.",
    "type": "Application and Data"
  },
  {
    "name": "Hibernate",
    "website": "http://hibernate.org/",
    "logo": "IMAGE_URL",
    "slug": "hibernate",
    "description": "Hibernate is a suite of open source projects around domain models. The flagship project is Hibernate ORM, the Object Relational Mapper.",
    "type": "Application and Data"
  },
  {
    "name": "Hugo",
    "website": "https://gohugo.io/",
    "logo": "IMAGE_URL",
    "slug": "hugo",
    "description": "Hugo is a static site generator written in Go. It is optimized for speed, easy use and configurability. Hugo takes a directory with content and templates and renders them into a full html website. Hugo makes use of markdown files with front matter for meta data.",
    "type": "Application and Data"
  },
  {
    "name": "Haskell",
    "website": "http://www.haskell.org/",
    "logo": "IMAGE_URL",
    "slug": "haskell",
    "description": "An advanced purely-functional programming language",
    "type": "Application and Data"
  },
  {
    "name": "Hotjar",
    "website": "http://www.hotjar.com",
    "logo": "IMAGE_URL",
    "slug": "hotjar",
    "description": "See how visitors are really using your website, collect user feedback and turn more visitors into customers.",
    "type": "Utilities"
  },
  {
    "name": "Red Hat Codeready Workspaces",
    "website": "https://developers.redhat.com/products/codeready-workspaces/overview",
    "logo": "IMAGE_URL",
    "slug": "red-hat-codeready-workspaces",
    "description": "Built on the open Eclipse Che project, Red Hat CodeReady Workspaces provides developer workspaces, which include all the tools and the dependencies that are needed to code, build, test, run, and debug applications. ",
    "type": "DevOps"
  },
  {
    "name": "Helm",
    "website": "https://helm.sh/",
    "logo": "IMAGE_URL",
    "slug": "helm",
    "description": "Helm is the best way to find, share, and use software built for Kubernetes.",
    "type": "DevOps"
  },
  {
    "name": "Heap",
    "website": "https://heap.io/",
    "logo": "IMAGE_URL",
    "slug": "heap",
    "description": "Heap automatically captures every user action in your app and lets you measure it all. Clicks, taps, swipes, form submissions, page views, and more. Track events and segment users instantly. No pushing code. No waiting for data to trickle in.",
    "type": "Utilities"
  },
  {
    "name": "HAML",
    "website": "http://haml.info/",
    "logo": "IMAGE_URL",
    "slug": "haml",
    "description": "Haml is a markup language that’s used to cleanly and simply describe the HTML of any web document, without the use of inline code. Haml functions as a replacement for inline page templating systems such as PHP, ERB, and ASP. However, Haml avoids the need for explicitly coding HTML into the template, because it is actually an abstract description of the HTML, with some code to generate dynamic content.",
    "type": "Language"
  },
  {
    "name": "hapi",
    "website": "http://hapijs.com/",
    "logo": "IMAGE_URL",
    "slug": "hapi",
    "description": "hapi is a simple to use configuration-centric framework with built-in support for input validation, caching, authentication, and other essential facilities for building web applications and services.",
    "type": "Framework"
  },
  {
    "name": "HBase",
    "website": "http://hbase.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "hbase",
    "description": "Apache HBase is an open-source, distributed, versioned, column-oriented store modeled after Google\" Bigtable: A Distributed Storage System for Structured Data by Chang et al. Just as Bigtable leverages the distributed data storage provided by the Google File System, HBase provides Bigtable-like capabilities on top of Apache Hadoop.",
    "type": "Database"
  },
  {
    "name": "JavaScript",
    "website": "https://developer.mozilla.org/en-US/docs/Web/JavaScript",
    "logo": "IMAGE_URL",
    "slug": "javascript",
    "description": "JavaScript is most known as the scripting language for Web pages, but used in many non-browser environments as well such as node.js or Apache CouchDB. It is a prototype-based, multi-paradigm scripting language that is dynamic,and supports object-oriented, imperative, and functional programming styles. ",
    "type": "Language"
  },
  {
    "name": "jQuery",
    "website": "http://jquery.com/",
    "logo": "IMAGE_URL",
    "slug": "jquery",
    "description": "jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML.",
    "type": "Library"
  },
  {
    "name": "Java",
    "website": "https://www.java.com",
    "logo": "IMAGE_URL",
    "slug": "java",
    "description": "Java is a programming language and computing platform first released by Sun Microsystems in 1995. There are lots of applications and websites that will not work unless you have Java installed, and more are created every day. Java is fast, secure, and reliable. From laptops to datacenters, game consoles to scientific supercomputers, cell phones to the Internet, Java is everywhere!",
    "type": "Language"
  },
  {
    "name": "Jenkins",
    "website": "http://jenkins-ci.org/",
    "logo": "IMAGE_URL",
    "slug": "jenkins",
    "description": "In a nutshell Jenkins CI is the leading open-source continuous integration server. Built with Java, it provides over 300 plugins to support building and testing virtually any project.",
    "type": "Service"
  },
  {
    "name": "Jira",
    "website": "https://www.atlassian.com/software/jira",
    "logo": "IMAGE_URL",
    "slug": "jira",
    "description": "Jira\"s secret sauce is the way it simplifies the complexities of software development into manageable units of work. \r\nJira comes out-of-the-box with everything agile teams need to ship value to customers faster.",
    "type": "Service"
  },
  {
    "name": "jQuery UI",
    "website": "http://jqueryui.com/",
    "logo": "IMAGE_URL",
    "slug": "jquery-ui",
    "description": "Whether you\"re building highly interactive web applications or you just need to add a date picker to a form control, jQuery UI is the perfect choice.",
    "type": "Service"
  },
  {
    "name": "Vue.js",
    "website": "http://vuejs.org/",
    "logo": "IMAGE_URL",
    "slug": "vue-js",
    "description": "It is a library for building interactive web interfaces. It provides data-reactive components with a simple and flexible API. ",
    "type": "Framework"
  },
  {
    "name": "Jest",
    "website": "http://facebook.github.io/jest/",
    "logo": "IMAGE_URL",
    "slug": "jest",
    "description": "Jest provides you with multiple layers on top of Jasmine.",
    "type": "Service"
  },
  {
    "name": "Moment.js",
    "website": "http://momentjs.com/",
    "logo": "IMAGE_URL",
    "slug": "moment-js",
    "description": "A javascript date library for parsing, validating, manipulating, and formatting dates.",
    "type": "Library"
  },
  {
    "name": "D3.js",
    "website": "http://d3js.org/",
    "logo": "IMAGE_URL",
    "slug": "d3",
    "description": "It is a JavaScript library for manipulating documents based on data. Emphasises on web standards gives you the full capabilities of modern browsers without tying yourself to a proprietary framework.",
    "type": "Library"
  },
  {
    "name": "Next.js",
    "website": "https://nextjs.org/",
    "logo": "IMAGE_URL",
    "slug": "next-js",
    "description": "Next.js is a minimalistic framework for server-rendered React applications.",
    "type": "Framework"
  },
  {
    "name": "Jekyll",
    "website": "http://jekyllrb.com/",
    "logo": "IMAGE_URL",
    "slug": "jekyll",
    "description": "Think of Jekyll as a file-based CMS, without all the complexity. Jekyll takes your content, renders Markdown and Liquid templates, and spits out a complete, static website ready to be served by Apache, Nginx or another web server. Jekyll is the engine behind GitHub Pages, which you can use to host sites right from your GitHub repositories.",
    "type": "Service"
  },
  {
    "name": "Jasmine",
    "website": "http://jasmine.github.io/",
    "logo": "IMAGE_URL",
    "slug": "jasmine",
    "description": "Jasmine is a Behavior Driven Development testing framework for JavaScript. It does not rely on browsers, DOM, or any JavaScript framework. Thus it\"s suited for websites, Node.js projects, or anywhere that JavaScript can run.",
    "type": "Service"
  },
  {
    "name": "JSON",
    "website": "http://www.json.org/",
    "logo": "IMAGE_URL",
    "slug": "json",
    "description": "JavaScript Object Notation is a lightweight data-interchange format. It is easy for humans to read and write. It is easy for machines to parse and generate. It is based on a subset of the JavaScript Programming Language.",
    "type": "Language"
  },
  {
    "name": "jQuery Mobile",
    "website": "http://jquerymobile.com/",
    "logo": "IMAGE_URL",
    "slug": "jquery-mobile",
    "description": "jQuery Mobile is a HTML5-based user interface system designed to make responsive web sites and apps that are accessible on all smartphone, tablet and desktop devices.",
    "type": "Service"
  },
  {
    "name": "Joomla!",
    "website": "http://www.joomla.org/",
    "logo": "IMAGE_URL",
    "slug": "joomla",
    "description": "Joomla is a simple and powerful web server application and it requires a server with PHP and either MySQL, PostgreSQL, or SQL Server to run it.",
    "type": "Service"
  },
  {
    "name": "Jupyter",
    "website": "http://jupyter.org",
    "logo": "IMAGE_URL",
    "slug": "jupyter",
    "description": "The Jupyter Notebook is a web-based interactive computing platform. The notebook combines live code, equations, narrative text, visualizations, interactive dashboards and other media.",
    "type": "Service"
  },
  {
    "name": "Chart.js",
    "website": "http://www.chartjs.org/",
    "logo": "IMAGE_URL",
    "slug": "chart-js",
    "description": "Visualize your data in 6 different ways. Each of them animated, with a load of customisation options and interactivity extensions.",
    "type": "Library"
  },
  {
    "name": "JUnit",
    "website": "http://junit.org/",
    "logo": "IMAGE_URL",
    "slug": "junit",
    "description": "JUnit is a simple framework to write repeatable tests. It is an instance of the xUnit architecture for unit testing frameworks.\r\n",
    "type": "Service"
  },
  {
    "name": "clipboard.js",
    "website": "https://clipboardjs.com/",
    "logo": "IMAGE_URL",
    "slug": "clipboard-js",
    "description": "Copying text to the clipboard shouldn\"t be hard. It shouldn\"t require dozens of steps to configure or hundreds of KBs to load. But most of all, it shouldn\"t depend on Flash or any bloated framework. That\"s why this tool exists.",
    "type": "Library"
  },
  {
    "name": "Kubernetes",
    "website": "http://kubernetes.io/",
    "logo": "IMAGE_URL",
    "slug": "kubernetes",
    "description": "Kubernetes is an open source orchestration system for Docker containers. It handles scheduling onto nodes in a compute cluster and actively manages workloads to ensure that their state matches the users declared intentions.",
    "type": "Service"
  },
  {
    "name": "Kafka",
    "website": "http://kafka.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "kafka",
    "description": "Kafka is a distributed, partitioned, replicated commit log service. It provides the functionality of a messaging system, but with a unique design.",
    "type": "Service"
  },
  {
    "name": "Kibana",
    "website": "http://www.elasticsearch.org/overview/kibana/",
    "logo": "IMAGE_URL",
    "slug": "kibana",
    "description": "Kibana is an open source (Apache Licensed), browser based analytics and search dashboard for Elasticsearch. Kibana is a snap to setup and start using. Kibana strives to be easy to get started with, while also being flexible and powerful, just like Elasticsearch.",
    "type": "Service"
  },
  {
    "name": "Kotlin",
    "website": "https://kotlinlang.org/",
    "logo": "IMAGE_URL",
    "slug": "kotlin",
    "description": "Kotlin is a statically typed programming language for the JVM, Android and the browser, 100% interoperable with Java",
    "type": "Service"
  },
  {
    "name": "Google Kubernetes Engine",
    "website": "https://cloud.google.com/kubernetes-engine/",
    "logo": "IMAGE_URL",
    "slug": "google-kubernetes-engine",
    "description": "Container Engine takes care of provisioning and maintaining the underlying virtual machine cluster, scaling your application, and operational logistics like logging, monitoring, and health management.",
    "type": "Service"
  },
  {
    "name": "Keras",
    "website": "https://keras.io/",
    "logo": "IMAGE_URL",
    "slug": "keras",
    "description": "Deep Learning library for Python. Convnets, recurrent neural networks, and more. Runs on TensorFlow or Theano. https://keras.io/",
    "type": "Service"
  },
  {
    "name": "Karma",
    "website": "http://karma-runner.github.io/",
    "logo": "IMAGE_URL",
    "slug": "karma-runner",
    "description": "Karma is not a testing framework, nor an assertion library. Karma just launches a HTTP server, and generates the test runner HTML file you probably already know from your favourite testing framework. So for testing purposes you can use pretty much anything you like. ",
    "type": "Service"
  },
  {
    "name": "Kong",
    "website": "https://github.com/Kong/kong",
    "logo": "https://ucarecdn.com/3cf09daa-4e1e-404e-a612-f8a91c661db2/",
    "slug": "kong",
    "description": "Kong is a scalable, open source API Layer (also known as an API Gateway, or API Middleware). Kong controls layer 4 and 7 traffic and is extended through Plugins, which provide extra functionality and services beyond the core platform.",
    "type": "Service"
  },
  {
    "name": "Amazon Kinesis",
    "website": "http://aws.amazon.com/kinesis/",
    "logo": "IMAGE_URL",
    "slug": "amazon-kinesis",
    "description": "Amazon Kinesis can collect and process hundreds of gigabytes of data per second from hundreds of thousands of sources, allowing you to easily write applications that process information in real-time, from sources such as web site click-streams, marketing and financial information, manufacturing instrumentation and social media, and operational logs and metering data. ",
    "type": "Service"
  },
  {
    "name": "KISSmetrics",
    "website": "https://www.kissmetricshq.com/",
    "logo": "IMAGE_URL",
    "slug": "kissmetrics",
    "description": "Optimize Your Business and Get More Customers. Identify, understand, and improve the metrics that drive your online business.",
    "type": "Service"
  },
  {
    "name": "Koa",
    "website": "http://koajs.com/",
    "logo": "IMAGE_URL",
    "slug": "koa",
    "description": "Koa aims to be a smaller, more expressive, and more robust foundation for web applications and APIs. Through leveraging generators Koa allows you to ditch callbacks and greatly increase error-handling. Koa does not bundle any middleware.",
    "type": "Service"
  },
  {
    "name": "Keycloak",
    "website": "https://www.keycloak.org/",
    "logo": "IMAGE_URL",
    "slug": "keycloak",
    "description": "It is an Open Source Identity and Access Management For Modern Applications and Services. It adds authentication to applications and secure services with minimum fuss. No need to deal with storing users or authenticating users. It\"s all available out of the box.\n\n\n",
    "type": "Service"
  },
  {
    "name": "Keen",
    "website": "https://keen.io/",
    "logo": "IMAGE_URL",
    "slug": "keen",
    "description": "Keen is a powerful set of API\"s that allow you to stream, store, query, and visualize event-based data. Customer-facing metrics bring SaaS products to the next level with acquiring, engaging, and retaining customers.",
    "type": "Service"
  },
  {
    "name": "Kendo UI",
    "website": "http://www.telerik.com/kendo-ui",
    "logo": "IMAGE_URL",
    "slug": "kendo-ui",
    "description": "Fast, light, complete: 70+ jQuery-based UI widgets in one powerful toolset. AngularJS integration, Bootstrap support, mobile controls, offline data solution.",
    "type": "Service"
  },
  {
    "name": "Kafka Streams",
    "website": "https://kafka.apache.org/documentation/streams/",
    "logo": "IMAGE_URL",
    "slug": "kafka-streams",
    "description": "It is a client library for building applications and microservices, where the input and output data are stored in Kafka clusters. It combines the simplicity of writing and deploying standard Java and Scala applications on the client side with the benefits of Kafka\"s server-side cluster technology.",
    "type": "Service"
  },
  {
    "name": "Web Starter Kit",
    "website": "https://developers.google.com/web/starter-kit/",
    "logo": "IMAGE_URL",
    "slug": "web-starter-kit",
    "description": "Web Starter Kit is a starting point for multi-screen web development. It encompasses opinionated recommendations on boilerplate and tooling for building an experience that works great across multiple devices. We help you stay productive and aligned with the best practices outlined in Google\"s Web Fundamentals.",
    "type": "Service"
  },
  {
    "name": "Azure Kubernetes Service",
    "website": "https://azure.microsoft.com/en-us/services/kubernetes-service/",
    "logo": "IMAGE_URL",
    "slug": "azure-kubernetes-service",
    "description": "Fully managed Kubernetes container orchestration service on Microsoft Azure.",
    "type": "Service"
  },
  {
    "name": "KnockoutJS",
    "website": "http://knockoutjs.com/",
    "logo": "IMAGE_URL",
    "slug": "knockout",
    "description": "Knockout is a JavaScript MVVM (a modern variant of MVC) library that makes it easier to create rich, desktop-like user interfaces with JavaScript and HTML. It uses observers to make your UI automatically stay in sync with an underlying data model, along with a powerful and extensible set of declarative bindings to enable productive development.",
    "type": "Service"
  },
  {
    "name": "Knex.js",
    "website": "http://knexjs.org/",
    "logo": "IMAGE_URL",
    "slug": "knex-js",
    "description": "Knex.js is a \"batteries included\" SQL query builder for Postgres, MySQL, MariaDB, SQLite3, and Oracle designed to be flexible, portable, and fun to use. It features both traditional node style callbacks as well as a promise interface for cleaner async flow control, a stream interface, full featured query and schema builders, transaction support (with savepoints), connection pooling and standardized responses between different query clients and dialects.",
    "type": "Service"
  },
  {
    "name": "KeyCDN",
    "website": "https://www.keycdn.com/",
    "logo": "IMAGE_URL",
    "slug": "keycdn",
    "description": "KeyCDN offers super fast and secure content delivery for minimal loading time. In addition to the CDN, it also offers advanced image processing and many other features such as live logs and Let\"s Encrypt SSL. ",
    "type": "Service"
  },
  {
    "name": "Laravel",
    "website": "http://laravel.com/",
    "logo": "IMAGE_URL",
    "slug": "laravel",
    "description": "It is a web application framework with expressive, elegant syntax. It attempts to take the pain out of development by easing common tasks used in the majority of web projects, such as authentication, routing, sessions, and caching.",
    "type": "Service"
  },
  {
    "name": "AWS Lambda",
    "website": "http://aws.amazon.com/lambda",
    "logo": "IMAGE_URL",
    "slug": "aws-lambda",
    "description": "AWS Lambda is a compute service that runs your code in response to events and automatically manages the underlying compute resources for you. You can use AWS Lambda to extend other AWS services with custom logic, or create your own back-end services that operate at AWS scale, performance, and security.",
    "type": "Service"
  },
  {
    "name": "Logstash",
    "website": "http://logstash.net/",
    "logo": "IMAGE_URL",
    "slug": "logstash",
    "description": "Logstash is a tool for managing events and logs. You can use it to collect logs, parse them, and store them for later use (like, for searching). If you store them in Elasticsearch, you can view and analyze them with Kibana.",
    "type": "Service"
  },
  {
    "name": "AWS Elastic Load Balancing (ELB)",
    "website": "http://aws.amazon.com/elasticloadbalancing/",
    "logo": "IMAGE_URL",
    "slug": "aws-elastic-load-balancing",
    "description": "With Elastic Load Balancing, you can add and remove EC2 instances as your needs change without disrupting the overall flow of information. If one EC2 instance fails, Elastic Load Balancing automatically reroutes the traffic to the remaining running EC2 instances. If the failed EC2 instance is restored, Elastic Load Balancing restores the traffic to that instance. Elastic Load Balancing offers clients a single point of contact, and it can also serve as the first line of defense against attacks on your network. You can offload the work of encryption and decryption to Elastic Load Balancing, so your servers can focus on their main task.",
    "type": "Service"
  },
  {
    "name": "Lodash",
    "website": "https://lodash.com",
    "logo": "IMAGE_URL",
    "slug": "lodash",
    "description": "A JavaScript utility library delivering consistency, modularity, performance, & extras. It provides utility functions for common programming tasks using the functional programming paradigm.",
    "type": "Service"
  },
  {
    "name": "Less",
    "website": "http://lesscss.org/",
    "logo": "IMAGE_URL",
    "slug": "less",
    "description": "Less is a CSS pre-processor, meaning that it extends the CSS language, adding features that allow variables, mixins, functions and many other techniques that allow you to make CSS that is more maintainable, themable and extendable.",
    "type": "Service"
  },
  {
    "name": "R Language",
    "website": "http://www.r-project.org/",
    "logo": "IMAGE_URL",
    "slug": "r-language",
    "description": "R provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, ...) and graphical techniques, and is highly extensible.",
    "type": "Service"
  },
  {
    "name": "Let\"s Encrypt",
    "website": "https://letsencrypt.org",
    "logo": "IMAGE_URL",
    "slug": "lets-encrypt",
    "description": "It is a free, automated, and open certificate authority brought to you by the non-profit Internet Security Research Group (ISRG).\r\n",
    "type": "Service"
  },
  {
    "name": "Linux",
    "website": "https://www.kernel.org/",
    "logo": "IMAGE_URL",
    "slug": "linux",
    "description": "A clone of the operating system Unix, written from scratch by Linus Torvalds with assistance from a loosely-knit team of hackers across the Net. It aims towards POSIX and Single UNIX Specification compliance.",
    "type": "Service"
  },
  {
    "name": "LiteSpeed",
    "website": "http://www.litespeedtech.com/products/litespeed-web-server/overview",
    "logo": "IMAGE_URL",
    "slug": "litespeed",
    "description": "It is a drop-in Apache replacement and the leading high-performance, high-scalability server. You can replace your existing Apache server with it without changing your configuration or operating system details. As a drop-in replacement, it allows you to quickly eliminate Apache bottlenecks in 15 minutes with zero downtime. ",
    "type": "Service"
  },
  {
    "name": "YUI Library",
    "website": "http://yuilibrary.com/",
    "logo": "IMAGE_URL",
    "slug": "yui",
    "description": "It is a free, open source JavaScript and CSS library for building richly interactive web applications. Its lightweight core and modular architecture make it scalable, fast, and robust. ",
    "type": "Service"
  },
  {
    "name": "Leaflet",
    "website": "http://leafletjs.com/",
    "logo": "IMAGE_URL",
    "slug": "leaflet",
    "description": "Leaflet is an open source JavaScript library for mobile-friendly interactive maps. It is developed by Vladimir Agafonkin of MapBox with a team of dedicated contributors. Weighing just about 30 KB of gzipped JS code, it has all the features most developers ever need for online maps.",
    "type": "Service"
  },
  {
    "name": "Puppet Labs",
    "website": "http://puppetlabs.com/",
    "logo": "IMAGE_URL",
    "slug": "puppet",
    "description": "Puppet is an automated administrative engine for your Linux, Unix, and Windows systems and performs administrative tasks (such as adding users, installing packages, and updating server configurations) based on a centralized specification.",
    "type": "Service"
  },
  {
    "name": "scikit-learn",
    "website": "http://scikit-learn.org/stable/",
    "logo": "IMAGE_URL",
    "slug": "scikit-learn",
    "description": "scikit-learn is a Python module for machine learning built on top of SciPy and distributed under the 3-Clause BSD license.",
    "type": "Service"
  },
  {
    "name": "Lua",
    "website": "http://www.lua.org/",
    "logo": "IMAGE_URL",
    "slug": "lua",
    "description": "Lua combines simple procedural syntax with powerful data description constructs based on associative arrays and extensible semantics. Lua is dynamically typed, runs by interpreting bytecode for a register-based virtual machine, and has automatic memory management with incremental garbage collection, making it ideal for configuration, scripting, and rapid prototyping.",
    "type": "Service"
  },
  {
    "name": "Linode",
    "website": "https://www.linode.com",
    "logo": "IMAGE_URL",
    "slug": "linode",
    "description": "Get a server running in minutes with your choice of Linux distro, resources, and node location.",
    "type": "Service"
  },
  {
    "name": "Material Design Lite",
    "website": "http://www.getmdl.io/",
    "logo": "IMAGE_URL",
    "slug": "material-design-lite",
    "description": "Material Design Lite (MDL) lets you add a Material Design look and feel to your static content websites. It doesn\"t rely on any JavaScript frameworks or libraries. Optimized for cross-device use, gracefully degrades in older browsers, and offers an experience that is accessible from the get-go.",
    "type": "Service"
  },
  {
    "name": "LiveChat",
    "website": "http://www.livechatinc.com/?utm_source=stackshare.io&utm_medium=referral&utm_campaign=StackShareListing",
    "logo": "IMAGE_URL",
    "slug": "livechat",
    "description": "LiveChat provides a live chat application with help desk and web analytics functionalities, allowing online businesses to communicate with visitors in real time.",
    "type": "Service"
  },
  {
    "name": "Lumen",
    "website": "http://lumen.laravel.com/",
    "logo": "IMAGE_URL",
    "slug": "lumen",
    "description": "Laravel Lumen is a stunningly fast PHP micro-framework for building web applications with expressive, elegant syntax. We believe development must be an enjoyable, creative experience to be truly fulfilling. Lumen attempts to take the pain out of development by easing common tasks used in the majority of web projects, such as routing, database abstraction, queueing, and caching.",
    "type": "Service"
  },
  {
    "name": "Sauce Labs",
    "website": "https://saucelabs.com",
    "logo": "IMAGE_URL",
    "slug": "sauce-labs",
    "description": "Cloud-based automated testing platform enables developers and QEs to perform functional, JavaScript unit, and manual tests with Selenium or Appium on web and mobile apps. Videos and screenshots for easy debugging. Secure and CI-ready.",
    "type": "Service"
  },
  {
    "name": "MySQL",
    "website": "http://www.mysql.com",
    "logo": "IMAGE_URL",
    "slug": "mysql",
    "description": "The MySQL software delivers a very fast, multi-threaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.",
    "type": "Application and Data"
  },
  {
    "name": "MongoDB",
    "website": "http://www.mongodb.com/",
    "logo": "IMAGE_URL",
    "slug": "mongodb",
    "description": "MongoDB stores data in JSON-like documents that can vary in structure, offering a dynamic, flexible schema. MongoDB was also designed for high availability and scalability, with built-in replication and auto-sharding.",
    "type": "Application and Data"
  },
  {
    "name": "Modernizr",
    "website": "https://modernizr.com/",
    "logo": "IMAGE_URL",
    "slug": "modernizr",
    "description": "It’s a collection of superfast tests or detects as we like to call them which run as your web page loads, then you can use the results to tailor the experience to the user. It tells you what HTML, CSS and JavaScript features the user’s browser has to offer.",
    "type": "DevOps"
  },
  {
    "name": "Mailchimp",
    "website": "http://mailchimp.com",
    "logo": "IMAGE_URL",
    "slug": "mailchimp",
    "description": "MailChimp helps you design email newsletters, share them on social networks, integrate with services you already use, and track your results. It\"s like your own personal publishing platform.",
    "type": "Business Tools"
  },
  {
    "name": "Markdown",
    "website": "http://daringfireball.net/projects/markdown/",
    "logo": "IMAGE_URL",
    "slug": "markdown",
    "description": "Markdown is two things: (1) a plain text formatting syntax; and (2) a software tool, written in Perl, that converts the plain text formatting to HTML. ",
    "type": "Application and Data"
  },
  {
    "name": "MariaDB",
    "website": "https://mariadb.com/",
    "logo": "IMAGE_URL",
    "slug": "mariadb",
    "description": "Started by core members of the original MySQL team, MariaDB actively works with outside developers to deliver the most featureful, stable, and sanely licensed open SQL server in the industry. MariaDB is designed as a drop-in replacement of MySQL(R) with more features, new storage engines, fewer bugs, and better performance.\r\n",
    "type": "Application and Data"
  },
  {
    "name": "Mailgun",
    "website": "http://mailgun.com",
    "logo": "IMAGE_URL",
    "slug": "mailgun",
    "description": "Mailgun is a set of powerful APIs that allow you to send, receive, track and store email effortlessly.",
    "type": "Utilities"
  },
  {
    "name": "Memcached",
    "website": "http://memcached.org/",
    "logo": "IMAGE_URL",
    "slug": "memcached",
    "description": "Memcached is an in-memory key-value store for small chunks of arbitrary data (strings, objects) from results of database calls, API calls, or page rendering.",
    "type": "Application and Data"
  },
  {
    "name": "Mixpanel",
    "website": "https://mixpanel.com",
    "logo": "IMAGE_URL",
    "slug": "mixpanel",
    "description": "Mixpanel is an advanced analytics service that helps improve web and mobile applications by tracking how users interact & engage with them. ",
    "type": "Utilities"
  },
  {
    "name": "Mandrill",
    "website": "http://mandrill.com",
    "logo": "IMAGE_URL",
    "slug": "mandrill",
    "description": "Mandrill is a new way for apps to send transactional email. It runs on the delivery infrastructure that powers MailChimp.",
    "type": "Utilities"
  },
  {
    "name": "Mocha",
    "website": "http://mochajs.org/",
    "logo": "IMAGE_URL",
    "slug": "mocha",
    "description": "Mocha is a feature-rich JavaScript test framework running on node.js and the browser, making asynchronous testing simple and fun. Mocha tests run serially, allowing for flexible and accurate reporting, while mapping uncaught exceptions to the correct test cases. ",
    "type": "DevOps"
  },
  {
    "name": "Meteor",
    "website": "https://www.meteor.com/",
    "logo": "IMAGE_URL",
    "slug": "meteor",
    "description": "A Meteor application is a mix of JavaScript that runs inside a client web browser, JavaScript that runs on the Meteor server inside a Node.js container, and all the supporting HTML fragments, CSS rules, and static assets. ",
    "type": "Application and Data"
  },
  {
    "name": "WordPress",
    "website": "http://wordpress.org",
    "logo": "IMAGE_URL",
    "slug": "wordpress",
    "description": "The core software is built by hundreds of community volunteers, and when you’re ready for more there are thousands of plugins and themes available to transform your site into almost anything you can imagine. Over 60 million people have chosen WordPress to power the place on the web they call “home” — we’d love you to join the family.",
    "type": "Business Tools"
  },
  {
    "name": "Webpack",
    "website": "http://webpack.js.org",
    "logo": "IMAGE_URL",
    "slug": "webpack",
    "description": "A bundler for javascript and friends. Packs many modules into a few bundled assets. Code Splitting allows to load parts for the application on demand. Through \"loaders\" modules can be CommonJs, AMD, ES6 modules, CSS, Images, JSON, Coffeescript, LESS, ... and your custom stuff.",
    "type": "DevOps"
  },
  {
    "name": "WebStorm",
    "website": "http://www.jetbrains.com/webstorm/",
    "logo": "IMAGE_URL",
    "slug": "webstorm",
    "description": "WebStorm is a lightweight and intelligent IDE for front-end development and server-side JavaScript.",
    "type": "DevOps"
  },
  {
    "name": "WooCommerce",
    "website": "http://www.woothemes.com/woocommerce/",
    "logo": "IMAGE_URL",
    "slug": "woocommerce",
    "description": "WooCommerce is the most popular WordPress eCommerce plugin. And it\"s available for free. Packed full of features, perfectly integrated into your self-hosted WordPress website.",
    "type": "Utilities"
  },
  {
    "name": "Windows",
    "website": "https://www.microsoft.com/en-us/windows",
    "logo": "IMAGE_URL",
    "slug": "windows",
    "description": "A series of personal computer operating systems produced by Microsoft as part of its Windows NT family of operating systems. ",
    "type": "Application and Data"
  },
  {
    "name": "Azure Websites",
    "website": "http://azure.microsoft.com/en-us/services/websites/",
    "logo": "IMAGE_URL",
    "slug": "azure-websites",
    "description": "Azure Websites is a fully managed Platform-as-a-Service (PaaS) that enables you to build, deploy and scale enterprise-grade web Apps in seconds. Focus on your application code, and let Azure take care of the infrastructure to scale and securely run it for you.",
    "type": "Application and Data"
  },
  {
    "name": "Weebly",
    "website": "http://www.weebly.com",
    "logo": "IMAGE_URL",
    "slug": "weebly",
    "description": "Weebly is an AJAX website creator that allows you to create pages with template skins and content widgets. Users can easily drag-and-drop content widgets like pictures, text, video and Google Maps in WYSIWYG-fashion. ",
    "type": "Utilities"
  },
  {
    "name": "Wix",
    "website": "http://www.wix.com/",
    "logo": "IMAGE_URL",
    "slug": "wix",
    "description": "Creating your stunning website for free is easier\r\nthan ever. No tech skills needed. Just pick a template,\r\nchange anything you want, add your images, videos,\r\ntext and more to get online instantly.",
    "type": "Business Tools"
  },
  {
    "name": "Webflow",
    "website": "https://webflow.com",
    "logo": "IMAGE_URL",
    "slug": "webflow",
    "description": "Webflow is a responsive design tool that lets you design, build, and publish websites in an intuitive interface. Clean code included!",
    "type": "Utilities"
  },
  {
    "name": "WP Rocket ",
    "website": "https://wp-rocket.me/",
    "logo": "IMAGE_URL",
    "slug": "wp-rocket",
    "description": "Speed up your WordPress website, more trafic, conversions and money with this caching plugin. Caching creates an ultra-fast load time, essential for improving Search Engine Optimization and increasing conversions.",
    "type": "Application and Data"
  },
  {
    "name": "Windows Server ",
    "website": "https://www.microsoft.com/en-us/cloud-platform/windows-server",
    "logo": "IMAGE_URL",
    "slug": "windows-server",
    "description": "It is a brand name for a group of server operating systems released by Microsoft. It includes all Windows operating systems, Increase security, evolve your data center, and innovate faster with Microsoft Windows Server, the cloud-ready operating system.",
    "type": "Application and Data"
  },
  {
    "name": "Windows 10",
    "website": "https://www.microsoft.com/en-us/windows",
    "logo": "IMAGE_URL",
    "slug": "windows-10",
    "description": "It is the latest iteration of the Microsoft operating systems and has been optimized for home PC performance in a wide variety of applications from serious work to after-hours gaming.",
    "type": "Application and Data"
  },
  {
    "name": "MySQL WorkBench",
    "website": "https://www.mysql.com/products/workbench/",
    "logo": "IMAGE_URL",
    "slug": "mysql-workbench",
    "description": "It enables a DBA, developer, or data architect to visually design, model, generate, and manage databases. It includes everything a data modeler needs for creating complex ER models, forward and reverse engineering, and also delivers key features for performing difficult change management and documentation tasks that normally require much time and effort.",
    "type": "Application and Data"
  },
  {
    "name": "wercker",
    "website": "http://wercker.com/",
    "logo": "IMAGE_URL",
    "slug": "wercker",
    "description": "Wercker is a CI/CD developer automation platform designed for Microservices & Container Architecture.",
    "type": "DevOps"
  },
  {
    "name": "WebRTC",
    "website": "http://www.webrtc.org",
    "logo": "IMAGE_URL",
    "slug": "webrtc",
    "description": "It is a free, open project that enables web browsers with Real-Time Communications (RTC) capabilities via simple JavaScript APIs. The WebRTC components have been optimized to best serve this purpose.",
    "type": "Business Tools"
  },
  {
    "name": "JSON Web Token",
    "website": "http://jwt.io/",
    "logo": "IMAGE_URL",
    "slug": "json-web-token",
    "description": "JSON Web Token is an open standard that defines a compact and self-contained way for securely transmitting information between parties as a JSON object. This information can be verified and trusted because it is digitally signed.",
    "type": "Application and Data"
  },
  {
    "name": "Xcode",
    "website": "https://developer.apple.com/xcode/",
    "logo": "IMAGE_URL",
    "slug": "xcode",
    "description": "The Xcode IDE is at the center of the Apple development experience. Tightly integrated with the Cocoa and Cocoa Touch frameworks, Xcode is an incredibly productive environment for building amazing apps for Mac, iPhone, and iPad.",
    "type": "DevOps"
  },
  {
    "name": "Xamarin",
    "website": "http://xamarin.com",
    "logo": "IMAGE_URL",
    "slug": "xamarin",
    "description": "Xamarin’s Mono-based products enable .NET developers to use their existing code, libraries and tools (including Visual Studio*), as well as skills in .NET and the C# programming language, to create mobile applications for the industry’s most widely-used mobile devices, including Android-based smartphones and tablets, iPhone, iPad and iPod Touch.",
    "type": "Application and Data"
  },
  {
    "name": "Adobe XD",
    "website": "https://www.adobe.com/products/xd.html",
    "logo": "IMAGE_URL",
    "slug": "adobe-xd",
    "description": "A vector-based tool developed and published by Adobe Inc for designing and prototyping user experience for web and mobile apps. ",
    "type": "Application and Data"
  },
  {
    "name": "XenForo",
    "website": "http://xenforo.com",
    "logo": "IMAGE_URL",
    "slug": "xenforo",
    "description": "It is a commercial Internet forum software package written in the PHP programming language.",
    "type": "Business Tools"
  },
  {
    "name": "XML",
    "website": "http://www.w3.org/XML/",
    "logo": "IMAGE_URL",
    "slug": "xml-format",
    "description": "A markup language that defines a set of rules for encoding documents in a format that is both human-readable and machine-readable.",
    "type": "Application and Data"
  },
  {
    "name": "Jenkins X",
    "website": "http://jenkins-x.io",
    "logo": "IMAGE_URL",
    "slug": "jenkins-x",
    "description": "Jenkins X is a CI/CD solution for modern cloud applications on Kubernetes",
    "type": "DevOps"
  },
  {
    "name": "Vert.x",
    "website": "http://vertx.io/",
    "logo": "IMAGE_URL",
    "slug": "vert-x",
    "description": "It is event driven and non blocking application framework. This means your app can handle a lot of concurrency using a small number of kernel threads. It lets your app scale with minimal hardware.",
    "type": "Application and Data"
  },
  {
    "name": "Xamarin Forms",
    "website": "http://developer.xamarin.com/guides/cross-platform/xamarin-forms/",
    "logo": "IMAGE_URL",
    "slug": "xamarin-forms",
    "description": "A mobile application framework for building user interfaces.It easily create native user interface layouts that can be shared across Android, iOS, and Windows Phone.",
    "type": "Application and Data"
  },
  {
    "name": "Mac OS X",
    "website": "https://www.apple.com/lae/macos/mojave/",
    "logo": "IMAGE_URL",
    "slug": "mac-os-x",
    "description": "It brings new features inspired by its most powerful users, but designed for everyone. Stay better focused on your work in Dark Mode. Automatically organize files using Stacks. ",
    "type": "Application and Data"
  },
  {
    "name": "Xero",
    "website": "https://www.xero.com",
    "logo": "IMAGE_URL",
    "slug": "xero",
    "description": "Inventory, invoicing, time tracking, expenses, and hundreds of other apps all seamlessly integrate with Xero to save your business precious time and money.",
    "type": "Business Tools"
  },
  {
    "name": "XAMPP",
    "website": "https://www.apachefriends.org/es/index.html",
    "logo": "IMAGE_URL",
    "slug": "xampp",
    "description": "It consists mainly of the Apache HTTP Server, MariaDB database, and interpreters for scripts written in the PHP and Perl programming languages.",
    "type": "Application and Data"
  },
  {
    "name": "xUnit",
    "website": "http://xunit.github.io/",
    "logo": "IMAGE_URL",
    "slug": "xunit",
    "description": "It is a free, open source, community-focused unit testing tool for the .NET Framework. It is the latest technology for unit testing C#, F#, VB.NET and other .NET languages. It works with ReSharper, CodeRush, TestDriven.NET and Xamarin.",
    "type": "DevOps"
  },
  {
    "name": "XMPP",
    "website": "http://xmpp.org",
    "logo": "IMAGE_URL",
    "slug": "xmpp",
    "description": "It is a set of open technologies for instant messaging, presence, multi-party chat, voice and video calls, collaboration, lightweight middleware, content syndication, and generalized routing of XML data.",
    "type": "Application and Data"
  },
  {
    "name": "Xamarin Test Cloud",
    "website": "http://xamarin.com/test-cloud",
    "logo": "IMAGE_URL",
    "slug": "xamarin-test-cloud",
    "description": "Run your app on our huge (and growing) collection of real devices from around the world. Select devices based on form factor, manufacturer, operating system, or even popularity in your target market. We’re adding over 100 devices every month, and if there’s a specific device you need, we’re taking requests.",
    "type": "Application and Data"
  },
  {
    "name": "Cocos2D-X",
    "website": "http://cocos2d-x.org/",
    "logo": "IMAGE_URL",
    "slug": "cocos2d-x",
    "description": "Cocos2d-x is an open-source and cross-platform open source free 2D game engine for mobile game development known for its speed, stability, and ease of use",
    "type": "Application and Data"
  },
  {
    "name": "AWS X-Ray",
    "website": "https://aws.amazon.com/xray",
    "logo": "IMAGE_URL",
    "slug": "aws-x-ray",
    "description": "It helps developers analyze and debug production, distributed applications, such as those built using a microservices architecture. With this, you can understand how your application and its underlying services are performing to identify and troubleshoot the root cause of performance issues and errors. It provides an end-to-end view of requests as they travel through your application, and shows a map of your application’s underlying components. ",
    "type": "Application and Data"
  },
  {
    "name": "Cocoa (OS X)",
    "website": "https://developer.apple.com/technologies/mac/cocoa.html",
    "logo": "IMAGE_URL",
    "slug": "cocoa",
    "description": "Much of Cocoa is implemented in Objective-C, an object-oriented language that is compiled to run at incredible speed, yet employs a truly dynamic runtime making it uniquely flexible. Because Objective-C is a superset of C, it is easy to mix C and even C++ into your Cocoa applications.",
    "type": "Application and Data"
  },
  {
    "name": "XGBoost",
    "website": "https://xgboost.ai/",
    "logo": "IMAGE_URL",
    "slug": "xgboost",
    "description": "Scalable, Portable and Distributed Gradient Boosting (GBDT, GBRT or GBM) Library, for Python, R, Java, Scala, C++ and more. Runs on single machine, Hadoop, Spark, Flink and DataFlow",
    "type": "Application and Data"
  },
  {
    "name": "XenServer",
    "website": "https://xenserver.org/",
    "logo": "IMAGE_URL",
    "slug": "xenserver",
    "description": "It is a leading virtualization management platform optimized for application, desktop and server virtualization infrastructures. It is used in the world\"s largest clouds and enterprises.",
    "type": "Application and Data"
  },
  {
    "name": "xlwings",
    "website": "http://xlwings.org/",
    "logo": "IMAGE_URL",
    "slug": "xlwings",
    "description": "Replace your VBA code with Python, a powerful yet easy-to-use programming language that is highly suited for numerical analysis. Supports Windows & Mac!",
    "type": "Business Tools"
  },
  {
    "name": "C++",
    "website": "http://www.cplusplus.com/",
    "logo": "IMAGE_URL",
    "slug": "cplusplus",
    "description": "C++ compiles directly to a machine\"s native code, allowing it to be one of the fastest languages in the world, if optimized.",
    "type": "Application and Data"
  },
  {
    "name": "C",
    "website": "http://en.wikipedia.org/wiki/C_(programming_language)",
    "logo": "IMAGE_URL",
    "slug": "c",
    "description": null,
    "type": "Application and Data"
  },
  {
    "name": "CloudFlare",
    "website": "http://www.cloudflare.com",
    "logo": "IMAGE_URL",
    "slug": "cloudflare",
    "description": "Cloudflare speeds up and protects millions of websites, APIs, SaaS services, and other properties connected to the Internet.",
    "type": "Utilities"
  },
  {
    "name": "CSS 3",
    "website": "https://developer.mozilla.org/en-US/docs/Web/CSS/CSS3",
    "logo": "IMAGE_URL",
    "slug": "css-3",
    "description": "CSS3 is the latest evolution of the Cascading Style Sheets language and aims at extending CSS2.1. It brings a lot of long-awaited novelties, like rounded corners, shadows, gradients, transitions or animations, as well as new layouts like multi-columns, flexible box or grid layouts. Experimental parts are vendor-prefixed and should either be avoided in production environments, or used with extreme caution as both their syntax and semantics can change in the future.",
    "type": "Application and Data"
  },
  {
    "name": "Confluence",
    "website": "https://www.atlassian.com/software/confluence",
    "logo": "IMAGE_URL",
    "slug": "confluence",
    "description": "Capture the knowledge that\"s too often lost in email inboxes and shared network drives in Confluence instead – where it\"s easy to find, use, and update.",
    "type": "Business Tools"
  },
  {
    "name": "CentOS",
    "website": "https://www.centos.org/",
    "logo": "IMAGE_URL",
    "slug": "centos",
    "description": "The CentOS Project is a community-driven free software effort focused on delivering a robust open source ecosystem. For users, we offer a consistent manageable platform that suits a wide variety of deployments. For open source communities, we offer a solid, predictable base to build upon, along with extensive resources to build, test, release, and maintain their code.",
    "type": "Application and Data"
  },
  {
    "name": "CircleCI",
    "website": "https://circleci.com/",
    "logo": "IMAGE_URL",
    "slug": "circleci",
    "description": "Continuous integration and delivery platform helps software teams rapidly release code with confidence by automating the build, test, and deploy process. Offers a modern software development platform that lets teams ramp.",
    "type": "DevOps"
  },
  {
    "name": "Amazon CloudWatch",
    "website": "http://aws.amazon.com/cloudwatch/",
    "logo": "IMAGE_URL",
    "slug": "amazon-cloudwatch",
    "description": "It helps you gain system-wide visibility into resource utilization, application performance, and operational health. It retrieve your monitoring data, view graphs to help take automated action based on the state of your cloud environment.",
    "type": "DevOps"
  },
  {
    "name": "Animate.css ",
    "website": "https://daneden.github.io/animate.css/",
    "logo": "IMAGE_URL",
    "slug": "animate-css",
    "description": "It is a bunch of cool, fun, and cross-browser animations for you to use in your projects. Great for emphasis, home pages, sliders, and general just-add-water-awesomeness.",
    "type": "Library"
  },
  {
    "name": "Cassandra",
    "website": "http://cassandra.apache.org/",
    "logo": "IMAGE_URL",
    "slug": "cassandra",
    "description": "Partitioning means that Cassandra can distribute your data across multiple machines in an application-transparent matter. Cassandra will automatically repartition as machines are added and removed from the cluster. Row store means that like relational databases, Cassandra organizes data by rows and columns. The Cassandra Query Language (CQL) is a close relative of SQL.",
    "type": "Application and Data"
  },
  {
    "name": "Salesforce Sales Cloud",
    "website": "http://www.salesforce.com/sales-cloud/overview",
    "logo": "IMAGE_URL",
    "slug": "salesforce-sales-cloud",
    "description": "The Sales Cloud puts everything you need at your fingertips—available anywhere. From Social accounts and contacts to Mobile, Chatter, and Analytics, collaboration across your global organization and getting deals done faster is not only possible, it\"s easy.",
    "type": "Business Tools"
  },
  {
    "name": "VirtualBox",
    "website": "https://www.virtualbox.org/",
    "logo": "IMAGE_URL",
    "slug": "virtualbox",
    "description": "VirtualBox is a powerful x86 and AMD64/Intel64 virtualization product for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL) version 2.",
    "type": "DevOps"
  },
  {
    "name": "Vim",
    "website": "http://www.vim.org/",
    "logo": "IMAGE_URL",
    "slug": "vim",
    "description": "Vim is an advanced text editor that seeks to provide the power of the de-facto Unix editor \"Vi\", with a more complete feature set. Vim is a highly configurable text editor built to enable efficient text editing. It is an improved version of the vi editor distributed with most UNIX systems. Vim is distributed free as charityware. ",
    "type": "DevOps"
  },
  {
    "name": "Varnish",
    "website": "https://www.varnish-cache.org/",
    "logo": "IMAGE_URL",
    "slug": "varnish",
    "description": "Varnish Cache is a web application accelerator also known as a caching HTTP reverse proxy. You install it in front of any server that speaks HTTP and configure it to cache the contents. Varnish Cache is really, really fast. It typically speeds up delivery with a factor of 300 - 1000x, depending on your architecture.",
    "type": "DevOps"
  },
  {
    "name": "Vagrant",
    "website": "http://www.vagrantup.com/",
    "logo": "IMAGE_URL",
    "slug": "vagrant",
    "description": "Vagrant provides the framework and configuration format to create and manage complete portable development environments. These development environments can live on your computer or in the cloud, and are portable between Windows, Mac OS X, and Linux.",
    "type": "DevOps"
  },
  {
    "name": "Amazon VPC",
    "website": "http://aws.amazon.com/vpc/",
    "logo": "IMAGE_URL",
    "slug": "amazon-vpc",
    "description": "You have complete control over your virtual networking environment, including selection of your own IP address range, creation of subnets, and configuration of route tables and network gateways. You can easily customize the network configuration for your Amazon VPC.",
    "type": "Application and Data"
  },
  {
    "name": "Vuetify",
    "website": "https://vuetifyjs.com/",
    "logo": "IMAGE_URL",
    "slug": "vuetify",
    "description": "Vuetify is a component framework for Vue.js 2. It aims to provide clean, semantic and reusable components that make building your application a breeze. Vuetify utilizes Google\"s Material Design design pattern, taking cues from other popular frameworks such as Materialize.css, Material Design Lite, Semantic UI and Bootstrap 4.",
    "type": "Application and Data"
  },
  {
    "name": "vuex",
    "website": "https://vuex.vuejs.org",
    "logo": "IMAGE_URL",
    "slug": "vuex",
    "description": "Vuex is a state management pattern + library for Vue.js applications. It serves as a centralized store for all the components in an application, with rules ensuring that the state can only be mutated in a predictable fashion. It also integrates with Vue\"s official devtools extension to provide advanced features such as zero-config time-travel debugging and state snapshot export / import.",
    "type": "Application and Data"
  },
  {
    "name": "Vault",
    "website": "https://www.vaultproject.io/",
    "logo": "IMAGE_URL",
    "slug": "vault",
    "description": "Vault is a tool for securely accessing secrets. A secret is anything that you want to tightly control access to, such as API keys, passwords, certificates, and more. Vault provides a unified interface to any secret, while providing tight access control and recording a detailed audit log.",
    "type": "DevOps"
  },
  {
    "name": "VMware vSphere",
    "website": "http://www.vmware.com/products/vsphere/",
    "logo": "IMAGE_URL",
    "slug": "vmware-vsphere",
    "description": "vSphere is the world’s leading server virtualization platform. Run fewer servers and reduce capital and operating costs using VMware vSphere to build a cloud computing infrastructure.",
    "type": "DevOps"
  },
  {
    "name": "Vue CLI",
    "website": "https://cli.vuejs.org/",
    "logo": "IMAGE_URL",
    "slug": "vue-cli",
    "description": "Vue CLI aims to be the standard tooling baseline for the Vue ecosystem. It ensures the various build tools work smoothly together with sensible defaults so you can focus on writing your app instead of spending days wrangling with config.",
    "type": "Application and Data"
  },
  {
    "name": "Visual Basic",
    "website": "http://msdn.microsoft.com/en-us/library/2x7h1hfk.aspx",
    "logo": "IMAGE_URL",
    "slug": "visual-basic",
    "description": "Visual Basic is derived from BASIC and enables the rapid application development (RAD) of graphical user interface (GUI) applications, access to databases using Data Access Objects, Remote Data Objects, or ActiveX Data Objects, and creation of ActiveX controls and objects.",
    "type": "Application and Data"
  },
  {
    "name": "Vercel",
    "website": "https://vercel.com/",
    "logo": "IMAGE_URL",
    "slug": "vercel",
    "description": "A cloud platform for serverless deployment. It enables developers to host websites and web services that deploy instantly, scale automatically, and require no supervision, all with minimal configuration.",
    "type": "Utilities"
  },
  {
    "name": "VuePress",
    "website": "https://vuepress.vuejs.org/",
    "logo": "IMAGE_URL",
    "slug": "vuepress",
    "description": "A minimalistic static site generator with a Vue-powered theming system, and a default theme optimized for writing technical documentation. It was created to support the documentation needs of Vue\"s own sub projects.",
    "type": "Utilities"
  },
  {
    "name": "Vue Native",
    "website": "https://vue-native.io",
    "logo": "IMAGE_URL",
    "slug": "vue-native",
    "description": "Vue Native is a mobile framework to build truly native mobile app using Vue.js. Its is designed to connect React Native and Vue.js.\r\n\r\nVue Native is a wrapper around React Native APIs, which allows you to use Vue.js and compose rich mobile User Interface.",
    "type": "Application and Data"
  },
  {
    "name": "Vue Router",
    "website": "https://router.vuejs.org/",
    "logo": "IMAGE_URL",
    "slug": "vue-router",
    "description": "It is the official router for Vue.js. It deeply integrates with Vue.js core to make building Single Page Applications with Vue.js a breeze.",
    "type": "Application and Data"
  },
  {
    "name": "Visual Studio Live Share",
    "website": "https://code.visualstudio.com/visual-studio-live-share",
    "logo": "IMAGE_URL",
    "slug": "visual-studio-live-share",
    "description": "When you start a live share session in Visual Studio 2017 or Visual Studio Code, your teammates get instant and secure access to your code in their own tool – no need to clone, copy, or configure anything.",
    "type": "DevOps"
  },
  {
    "name": "Bootstrap",
    "website": "http://getbootstrap.com/",
    "logo": "IMAGE_URL",
    "slug": "bootstrap",
    "description": "Bootstrap is the most popular HTML, CSS, and JS framework for developing responsive, mobile first projects on the web.",
    "type": "Application and Data"
  },
  {
    "name": "Bitbucket",
    "website": "https://bitbucket.org",
    "logo": "IMAGE_URL",
    "slug": "bitbucket",
    "description": "Bitbucket gives teams one place to plan projects, collaborate on code, test and deploy, all with free private Git repositories. Teams choose Bitbucket because it has a superior Jira integration, built-in CI/CD, & is free for up to 5 users.",
    "type": "DevOps"
  },
  {
    "name": "Babel",
    "website": "http://babeljs.io/",
    "logo": "IMAGE_URL",
    "slug": "babel",
    "description": "Babel will turn your ES6+ code into ES5 friendly code, so you can start using it right now without waiting for browser support.",
    "type": "DevOps"
  },
  {
    "name": "Bower",
    "website": "http://bower.io/",
    "logo": "IMAGE_URL",
    "slug": "bower",
    "description": "Bower is a package manager for the web. It offers a generic, unopinionated solution to the problem of front-end package management, while exposing the package dependency model via an API that can be consumed by a more opinionated build stack. There are no system wide dependencies, no dependencies are shared between different apps, and the dependency tree is flat.",
    "type": "Tool"
  },
  {
    "name": "Backbone.js",
    "website": "http://backbonejs.org/",
    "logo": "IMAGE_URL",
    "slug": "backbone",
    "description": "Backbone supplies structure to JavaScript-heavy applications by providing models key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all to your existing application over a RESTful JSON interface.",
    "type": "Application and Data"
  },
  {
    "name": "BrowserStack",
    "website": "http://www.browserstack.com",
    "logo": "IMAGE_URL",
    "slug": "browserstack",
    "description": "Live, Web-Based Browser Testing\r\nInstant access to all real mobile and desktop browsers. Say goodbye to your lab of devices and virtual machines.",
    "type": "DevOps"
  },
  {
    "name": "Google BigQuery",
    "website": "https://cloud.google.com/bigquery/what-is-bigquery",
    "logo": "IMAGE_URL",
    "slug": "google-bigquery",
    "description": "Run super-fast, SQL-like queries against terabytes of data in seconds, using the processing power of Google\"s infrastructure.\r\nLoad data with ease. Bulk load your data using Google Cloud Storage or stream it in.\r\nEasy access. Access BigQuery by using a browser tool, a command-line tool, or by making calls to the BigQuery REST API with client libraries such as Java, PHP or Python.",
    "type": "Application and Data"
  },
  {
    "name": "Bugsnag",
    "website": "https://www.bugsnag.com",
    "logo": "IMAGE_URL",
    "slug": "bugsnag",
    "description": "Bugsnag captures errors from your web, mobile and back-end applications, providing instant visibility into user impact.  Diagnostic data and tools are included to help your team prioritize, debug and fix exceptions fast.",
    "type": "DevOps"
  },
  {
    "name": "Balsamiq",
    "website": "http://www.balsamiq.com",
    "logo": "IMAGE_URL",
    "slug": "balsamiq",
    "description": "Balsamiq Mockups is a web tool that allows users to mock up different designs and ideas quickly and easily. Balsamic Mockups is similar to drawing mockups, but it is digital",
    "type": "Business Tools"
  },
  {
    "name": "Basecamp",
    "website": "http://basecamp.com",
    "logo": "IMAGE_URL",
    "slug": "basecamp",
    "description": "Basecamp is a project management and group collaboration tool. The tool includes features for schedules, tasks, files, and messages.",
    "type": "Business Tools"
  },
  {
    "name": "Browserify",
    "website": "http://browserify.org/",
    "logo": "IMAGE_URL",
    "slug": "browserify",
    "description": "Browserify lets you require(\"modules\") in the browser by bundling up all of your dependencies.",
    "type": "DevOps"
  },
  {
    "name": "GNU Bash",
    "website": "http://www.gnu.org/software/bash/",
    "logo": "IMAGE_URL",
    "slug": "gnu-bash",
    "description": "The Bourne Again SHell is an sh-compatible shell that incorporates useful features from the Korn shell (ksh) and C shell (csh). It is intended to conform to the IEEE POSIX P1003.2/ISO 9945.2 Shell and Tools standard.",
    "type": "Application and Data"
  },
  {
    "name": "Brackets",
    "website": "http://brackets.io/",
    "logo": "IMAGE_URL",
    "slug": "brackets",
    "description": "With focused visual tools and preprocessor support, it is a modern text editor that makes it easy to design in the browser. ",
    "type": "DevOps"
  },
  {
    "name": "Braintree",
    "website": "https://www.braintreepayments.com",
    "logo": "IMAGE_URL",
    "slug": "braintree",
    "description": "Braintree replaces traditional payment gateways and merchant accounts. From one touch payments, to mobile SDKs and international sales, we provide everything you need to start accepting payments today.",
    "type": "Utilities"
  },
  {
    "name": "Bulma",
    "website": "http://bulma.io/",
    "logo": "IMAGE_URL",
    "slug": "bulma",
    "description": "Bulma is a CSS framework based on Flexbox and built with Sass\r\n",
    "type": "Application and Data"
  },
  {
    "name": "Buffer",
    "website": "https://bufferapp.com/",
    "logo": "IMAGE_URL",
    "slug": "buffer",
    "description": "Buffer helps you manage multiple social media accounts at once. Quickly schedule content from anywhere on the web, collaborate with team members, and analyze rich statistics on how your posts perform.",
    "type": "Business Tools"
  },
  {
    "name": "Bamboo",
    "website": "https://www.atlassian.com/software/bamboo",
    "logo": "IMAGE_URL",
    "slug": "bamboo",
    "description": "Focus on coding and count on Bamboo as your CI and build server! Create multi-stage build plans, set up triggers to start builds upon commits, and assign agents to your critical builds and deployments.",
    "type": "DevOps"
  },
  {
    "name": "Node.js",
    "website": "http://nodejs.org/",
    "logo": "IMAGE_URL",
    "slug": "nodejs",
    "description": "Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.",
    "type": "Application and Data"
  },
  {
    "name": "nginx",
    "website": "http://nginx.org",
    "logo": "IMAGE_URL",
    "slug": "nginx",
    "description": "nginx [engine x] is an HTTP and reverse proxy server, as well as a mail proxy server, written by Igor Sysoev. According to Netcraft nginx served or proxied 30.46% of the top million busiest sites in Jan 2018.",
    "type": "Application and Data"
  },
  {
    "name": "npm",
    "website": "https://www.npmjs.com/",
    "logo": "IMAGE_URL",
    "slug": "npm",
    "description": "npm is the command-line interface to the npm ecosystem. It is battle-tested, surprisingly flexible, and used by hundreds of thousands of JavaScript developers every day.",
    "type": "DevOps"
  },
  {
    "name": "Notepad++",
    "website": "http://notepad-plus-plus.org/",
    "logo": "IMAGE_URL",
    "slug": "notepad-plus-plus",
    "description": "Notepad++ is a free (as in \"free speech\" and also as in \"free beer\") source code editor and Notepad replacement that supports several languages. Running in the MS Windows environment, its use is governed by GPL License.",
    "type": "DevOps"
  },
  {
    "name": ".NET",
    "website": "http://www.microsoft.com/net/",
    "logo": "IMAGE_URL",
    "slug": "dot-net",
    "description": ".NET is a general purpose development platform. With .NET, you can use multiple languages, editors, and libraries to build native applications for web, mobile, desktop, gaming, and IoT for Windows, macOS, Linux, Android, and more.",
    "type": "Application and Data"
  },
  {
    "name": "Namecheap",
    "website": "http://www.namecheap.com",
    "logo": "IMAGE_URL",
    "slug": "namecheap",
    "description": "We provide a set of DNS servers spread across the US and Europe to deliver highly reliable DNS services to everyone. By choosing Namecheap.com as your domain registrar, you are choosing a highly reputable and reliable partner. Namecheap.com is rated 4.6 out of 5 - Based on 1,395 reviews via Google Checkout",
    "type": "Utilities"
  },
  {
    "name": "Netlify",
    "website": "https://www.netlify.com/",
    "logo": "IMAGE_URL",
    "slug": "netlify",
    "description": "Netlify is smart enough to process your site and make sure all assets gets optimized and served with perfect caching-headers from a cookie-less domain. We make sure your HTML is served straight from our CDN edge nodes without any round-trip to our backend servers and are the only ones to give you instant cache invalidation when you push a new deploy. Netlify is also the only static hosting service with integrated continuous deployment.",
    "type": "Utilities"
  },
  {
    "name": ".NET Core",
    "website": "https://docs.microsoft.com/en-us/dotnet/core/",
    "logo": "IMAGE_URL",
    "slug": "dot-net-core",
    "description": "Cross-platform (supporting Windows, macOS, and Linux) and can be used to build device, cloud, and IoT applications.",
    "type": "Application and Data"
  },
  {
    "name": "Neo4j",
    "website": "http://www.neo4j.com/",
    "logo": "IMAGE_URL",
    "slug": "neo4j",
    "description": "Neo4j stores data in nodes connected by directed, typed relationships with properties on both, also known as a Property Graph. It is a high performance graph store with all the features expected of a mature and robust database, like a friendly query language and ACID transactions.",
    "type": "Application and Data"
  },
  {
    "name": "Nagios",
    "website": "http://www.nagios.org/",
    "logo": "IMAGE_URL",
    "slug": "nagios",
    "description": "Nagios is a host/service/network monitoring program written in C and\r\nreleased under the GNU General Public License.",
    "type": "DevOps"
  },
  {
    "name": "Nuxt.js",
    "website": "https://nuxtjs.org",
    "logo": "IMAGE_URL",
    "slug": "nuxt",
    "description": "Nuxt.js presets all the configuration needed to make your development of a Vue.js application enjoyable.\r\n\r\nYou can use Nuxt.js for SSR, SPA, Static Generated, PWA and more.",
    "type": "Application and Data"
  },
  {
    "name": "ASP.NET Core",
    "website": "docs.microsoft.com/en-us/aspnet/core/",
    "logo": "IMAGE_URL",
    "slug": "asp-net-core",
    "description": "A free and open-source web framework, and higher performance than ASP.NET, developed by Microsoft and the community. It is a modular framework that runs on both the full .NET Framework, on Windows, and the cross-platform .NET Core.",
    "type": "Application and Data"
  },
  {
    "name": "NativeScript",
    "website": "https://www.nativescript.org/",
    "logo": "IMAGE_URL",
    "slug": "nativescript",
    "description": "NativeScript enables developers to build native apps for iOS, Android and Windows Universal while sharing the application code across the platforms. When building the application UI, developers use our libraries, which abstract the differences between the native platforms.",
    "type": "Application and Data"
  },
  {
    "name": "NetBeans IDE",
    "website": "https://netbeans.org/",
    "logo": "IMAGE_URL",
    "slug": "netbeans",
    "description": "NetBeans IDE is FREE, open source, and has a worldwide community of users and developers.",
    "type": "DevOps"
  },
  {
    "name": "NumPy",
    "website": "http://www.numpy.org/",
    "logo": "IMAGE_URL",
    "slug": "numpy",
    "description": "Besides its obvious scientific uses, NumPy can also be used as an efficient multi-dimensional container of generic data. Arbitrary data-types can be defined. This allows NumPy to seamlessly and speedily integrate with a wide variety of databases.",
    "type": "Application and Data"
  },
  {
    "name": "NestJS",
    "website": "nestjs.com",
    "logo": "IMAGE_URL",
    "slug": "nestjs",
    "description": "Nest is a framework for building efficient, scalable Node.js server-side applications. It uses progressive JavaScript, is built with TypeScript (preserves compatibility with pure JavaScript) and combines elements of OOP (Object Oriented Programming), FP (Functional Programming), and FRP (Functional Reactive Programming).\r\n\r\nUnder the hood, Nest makes use of Express, but also, provides compatibility with a wide range of other libraries, like e.g. Fastify, allowing for easy use of the myriad third-party plugins which are available.",
    "type": "Application and Data"
  }
]